[
    {
        "id": "thanksgiving-kitchen-safety-tips",
        "image": "/img/blog/pexels-tima-miroshnichenko-5591206.jpg",
        "title": "Prevent Common Accidents with Key Kitchen Safety Tips",
        "subtitle": "Preventive Measures to Avoid Urgent Care on Thanksgiving",
        "content": "<p>Thanksgiving is a time of great food, fun with family and friends and counting blessings. Unfortunately, for some it is also a time when they have to spend hours in urgent care due to an injury.</p><p> In 2016, <a target='_blank' rel='noopener noreferrer'  href='https://www.businessinsider.com/why-thanksgiving-emergency-room-visits-spike-doctors-2017-11' > over 36,000 people </a> visited emergency rooms around the country on Thanksgiving day. Many of these injuries were related to cooking, including burns and cuts.</p><p> Kitchen safety for Thanksgiving involves simple precautions that help keep everyone safe. To avoid having your holiday ruined by a visit to urgent care, follow these simple tips!</p><h2> Most Common Kitchen Injuries and How to Prevent Them</h2><p> During Thanksgiving, there are more people in the kitchen than usual — nationwide and in individual kitchens. You might have four or five people cooking rather than the usual one or two. Too many cooks in the kitchen not only spoil the broth, it can also lead to more accidents – especially if you try new cooking techniques.</p><p> In addition, drinking causes impairment, leading to significant accidents while cooking. A big part of kitchen safety for Thanksgiving is ensuring anyone who has been drinking isn’t in the kitchen near hot food and appliances.</p><p> Here are other common Thanksgiving injuries to watch out for.</p><h3> Burns</h3><p> Burns are especially common on Thanksgiving. Some people try to fry a turkey for the first time and suffer grease burns, and there are more kitchen fires on Thanksgiving as well.</p><p> To avoid burns:</p><ul> <li> <p> Use turkey fryers correctly according to the directions — always outdoors, with a fully thawed turkey, and with a lot of attention </p></li><li> <p> Remember that unattended food in the kitchen can boil over or cause fires </p></li><li> <p> Use oven mitts when moving hot food </p></li><li> <p> Consider having fewer people in the kitchen </p></li><li> <p> Have a fire extinguisher handy </p></li></ul><h3> Knife Injuries</h3><p> There’s a lot of chopping on Thanksgiving, and that can lead to accidents with knives. A cut can be serious and require a trip to urgent care, so it pays to be careful.</p><p> To avoid knife accidents:</p><ul> <li> <p> Ensure that children are supervised if they are helping with chopping </p></li><li> <p> Keep knives sharp </p></li><li> <p> Slice away from your hands and fingers </p></li><li> <p> Keep a first aid kit handy with disinfectant and bandages </p></li></ul><h3> Food Poisoning</h3><p> Food poisoning can happen if food is left out for too long, but it’s also possible due to undercooked turkeys and other meat.</p><p> To avoid food poisoning:</p><ul> <li> <p> Make sure your turkey is fully thawed before Thanksgiving day </p></li><li> <p> Plan for plenty of cooking time, so you aren’t tempted to serve undercooked meat </p></li><li> <p> Put leftovers in the fridge right away </p></li></ul><p> When you follow these simple guidelines, you’ll be safer and less likely to need a visit to urgent care this Thanksgiving!</p><h2> Keeping Kids Safe While Cooking</h2><p> Thanksgiving is a great time to have younger family members help out in the kitchen, and there’s plenty of work to go around. However, it’s important to keep kids safe when they are helping out.</p><p> Part of kitchen safety for Thanksgiving is to keep folks out of the kitchen if they aren’t cooking, whether they are a child or adult. Unfortunately, the more people in the area, the higher the chance of accidents.</p><p> Next, ensure that children helping cook are shown the correct way to use kitchen tools. From a potato masher to a knife, a few minutes of instruction can help save you from an unfortunate accident. Help kids understand that helping in the kitchen is fun but that safety is paramount — pointing knives at others or flailing around is not appropriate.</p><p> Finally, have an adult supervising the children who are helping in the kitchen. Keeping an eye on kids can help them act responsibly, and you might be able to correct unsafe behavior before an accident happens.</p><h2> How to Know If You Should Visit the ER or Urgent Care</h2><p> If there is an accident and someone is injured, it’s important to get the right care right away. However, you might wonder if you should go to the emergency room or go to urgent care.</p><p> Urgent care clinics can do more for you than you might expect — and the cost is substantially lower as well. An urgent care can perform X-rays, MRIs, ultrasound, give stitches for cuts, casts for broken bones, and more.</p><p> However, a serious medical condition or injury will need emergency room care. These include life-threatening injuries and conditions, including heart attacks, severe or widespread burns, and cuts where you cannot stop the bleeding.</p><p> If you’re in a non-life-threatening situation, urgent care can generally give you the attention you need more quickly and at a lower cost than an emergency room.</p><h2> Practice Kitchen Safety This Thanksgiving</h2><p> Thanksgiving is a time of celebration and fun with family and friends. When you practice kitchen safety for Thanksgiving, you can avoid being interrupted by a trip to urgent care.</p><p> However, if someone is injured, it’s vital to get the care they need. Unless it’s life-threatening, your local urgent care clinic is a great choice for lower-cost, faster healthcare.</p><p> Have a great Thanksgiving!</p><br/><p> We hope you won’t need us, but if you do, we’re open on Thanksgiving at our mobile station. Click here to see our <a href='/locations'>locations</a>.</p>"
    },
    {
        "id": "getting-the-flu-shot",
        "image": "/img/blog/pexels-cdc-3993211.jpg",
        "title": "What you need to know about getting the flu shot",
        "subtitle": "Getting sick with the flu during the winter flu season can mean aches, pains and general discomfort. This coupled with missed school or work makes contracting the flu especially unpleasant.",
        "content": "<p>Influenza is a viral infection that attacks your respiratory system, which includes your nose, throat and lungs. A standard case of the flu is enough to put you out for days. Severe cases can lead to hospitalizations and death.</p><br/><p>Fortunately, the flu shot can reduce the likelihood of getting sick with the flu. Flu vaccination reduces the risk of flu illness between 40 and 60percent. While it’s still possible to get sick with the flu even after getting a flu shot, contrary to popular belief the flu shot does not cause the flu. Some people may feel ill or have a reaction after a dose of flu vaccine, but this reaction is not a case of the flu. Accessing the flu shot at Qcare, as well as at clinics and pharmacies located around New York City, makes getting the flu shot quick and easy. In this guide, we cover everything you need to know about getting a flu shot.</p><br/><h2>Common misconceptions about getting a flu shot</h2><p>Now is the time to decide whether or not you’ll get a flu shot this year. Let’s discuss some common misconceptions about the flu shot that could weigh into your decision.</p><br/><p><span className='font-bold'>The flu shot will make me get the flu.</span> The standard-dose influenza vaccine is made from an inactivated virus. The flu shot does not cause the flu.</p><br/><p>After getting a flu shot, you may experience side effects like headaches, low-grade fever or fatigue. The influenza vaccine protects you from experiencing severe symptoms of the flu virus itself.</p><br/><p>During flu season, other respiratory illnesses will be going around. Flu-like symptoms may be from an illness like the common cold.</p><br/><p><span className='font-bold'>I never get sick, so I don’t need a flu shot.</span> Even if you’re a healthy individual, you should get a flu shot to protect yourself and the loved ones around you.</p><br/><p><span className='font-bold'>There are other strains of the flu. This flu shot may not protect me from the right one.</span></p><p>Every year, scientists study trends to predict which strains of the flu will be the worst. The flu vaccine is designed to protect against two Influenza A viruses and two Influenza B viruses.</p><br/><p><span className='font-bold'>I can’t get the flu shot because I’m allergic to eggs.</span> The standard flu shot contains egg proteins. People with egg allergies can get the <a target='_blank' rel='noopener noreferrer'  href='https://www.cdc.gov/flu/prevent/qa_flublok-vaccine.htm'>Recombinant Influenza Vaccine</a>, which is an egg-free vaccine.</p><br/><h2>What is the flu?</h2><p>Flu season occurs during the fall and winter months. The Centers for Disease Control (CDC) predicts an initial surge of flu cases in October. Flu season is expected to peak between December and February.</p><br/><p>The flu shares many symptoms with other respiratory viruses that go around during flu season. Because colds and flu share many symptoms, it can be difficult (or even impossible) to tell the difference between them based on symptoms alone. A (laboratory-based influenza diagnostic test can tell if a person is sick with the flu. You can find out if you have the flu by getting a rapid flu test at a <a href='/locations'>testing center</a> near you.</p><br/><p>Here are some common symptoms of the flu:</p><br/><ul><li><p>Fever</p></li><li><p>Body aches</p></li><li><p>Cough</p></li><li><p>Sore throat</p></li><li><p>Runny or stuffy nose</p></li><li><p>Diarrhea (more common in children than adults)</p></li></ul><br/><p>This chart from the CDC is helpful to explain some of the key differences between a cold and the flu.</p><p><img src='/img/blog/flu-blog-content.png'/></p><h2>Who should get a flu shot?</h2><p>If you’re a generally healthy woman, you may be wondering if you need a flu shot this year. The CDC recommends everyone over 6 months old get a flu shot, with few exceptions.</p><br/><p>Even if you don’t usually get sick from respiratory bugs, you can spread the flu to <span className='font-bold'>high-risk</span> people if you’re not vaccinated.</p><br/><p>People at high risk of getting severely ill from the flu include:</p><br/><ul><li><p>Premature babies</p></li><li><p>Infants</p></li><li><p>Pregnant women</p></li><li><p>Adults older than 65</p></li><li><p>People with a chronic illness or weak immune system</p></li></ul><br/><p>High-risk individuals may have a difficult time fighting the flu. This can cause serious lung problems requiring hospitalizations for oxygen therapy or breathing machines.</p><br/><p>If you’re on the fence about whether or not to get a flu shot, consider the ages and health status of the people close to you.</p><br/><h3>Should pregnant women get a flu shot?</h3><p>Pregnant women are encouraged to get the flu shot to protect themselves and their babies.</p><br/><p>During pregnancy, your body experiences changes that affect your heart, lungs and immune system. This puts you at a higher risk of getting sick from the flu if you’re pregnant.</p><br/><p>Women who get a flu shot during pregnancy protect their babies well afterbirth. Since babies can’t get a flu shot until they’re 6 months old, newborns benefit from the immunity the vaccine provides.</p><br/><p>The flu shot is safe for pregnant women and people who are trying to conceive. You can get the flu shot <a target='_blank' rel='noopener noreferrer'  href='https://www.mayoclinic.org/healthy-lifestyle/pregnancy-week-by-week/expert-answers/influenza/faq-20058522'>at any time during pregnancy</a>. However, women in their first or second trimester shouldn’t get vaccinated early in the summer months. The CDC recommends waiting until fall to get a flu shot so you are protected for the entire season.</p><br/><h3>Flu shots for adults over 65</h3><p>Older adults are at higher risk of getting sick from the flu because the immune system weakens as you age. In recent years, adults over 65 made up for:</p><br/><ul><li><p><a target='_blank' rel='noopener noreferrer'  href='https://www.cdc.gov/flu/highrisk/65over.htm'>50-70%</a> of flu-related hospitalizations</p></li><li><p><a target='_blank' rel='noopener noreferrer'  href='https://www.cdc.gov/flu/highrisk/65over.htm'>70-85%</a> of flu-related deaths</p></li></ul><br/><p>Adults above 65 may qualify for <a target='_blank' rel='noopener noreferrer'  href='https://www.cdc.gov/flu/prevent/qa_fluzone.htm'>higher-dose flu shots</a>. It’s safe to get a flu shot at the same time as other vaccines. Talk to your doctor about which vaccines you may need for your age.</p><br/><h3>The flu shot is important for people with chronic illness</h3><p>If you live with a chronic illness, you want to protect yourself from unnecessary illnesses and hospitalizations.</p><br/><p>People with certain chronic diseases and risk factors are at a higher risk of getting seriously ill from the flu. These <a target='_blank' rel='noopener noreferrer'  href='https://www.aarp.org/health/conditions-treatments/info-2020/flu-risk-factors.html?cmp=KNC-DSO-COR-Health-ColdFlu-NonBrand-Exact-29256-GOOG-HEALTH-ConditionsTreatments-Health-RiskFactors-Exact-NonBrand&amp;gclid=Cj0KCQjwj7CZBhDHARIsAPPWv3d1m-W3Bw5GzS0P8Lb9XZNWkgeUndP3XG0ByFjAkI_3odLtwZS7JZgaAk8FEALw_wcB&amp;gclsrc=aw.ds'>risk factors</a> include:</p><br/><ul><li><p>Diabetes</p></li><li><p>Heart disease</p></li><li><p>History of stroke</p></li><li><p>Lung disease</p></li><li><p>Asthma</p></li><li><p>Weak immune system</p></li><li><p>Obesity</p></li></ul><br/><p>If you have a chronic illness, talk to your doctor about getting a flu shot. There are very few exceptions for people who shouldn’t get the vaccine.</p><br/><p>Tell your doctor if you have ever been diagnosed with Guillain-Barre Syndrome or have ever had a severe reaction to the flu shot.</p><br/><h2>Summary</h2><p>The flu shot is a safe and effective way to protect yourself and others from the flu this season. Consider getting a flu shot if you have certain risk factors like advanced age, pregnancy or a chronic illness.</p><br/><p>Even if you’re generally healthy, consider getting vaccinated. When healthy people get the flu shot, you protect all the people around you. Visit a Qcare urgent care clinic to get a flu shot today.</p>"
    },
    {
        "id": "know-about-RSV-this-season",
        "image": "/img/blog/little-girl-t-shirt-apron-suffering-from-cough-looking-upset.jpg",
        "title": "What parents and seniors need know about RSV this season",
        "subtitle": "Learn the signs and symptoms of RSV as rates spike in New York City",
        "content": "<p> RSV among children is <a target='_blank' rel='noopener noreferrer'  href='https://www.cbsnews.com/newyork/news/rsv-and-other-respiratory-illnesses-spiking-in-children-across-tri-state/' > on the rise in New York </a> , and some medical centers have had to focus their resources on providing additional care. ER visits among children under age 5 have spiked to rates not seen since the Omicron wave last December. Doctors are concerned the nation could face a <a target='_blank' rel='noopener noreferrer'  href='https://abcnews.go.com/Health/us-facing-potential-tripledemic-flu-rsv-covid-19/story?id=91997909' > 'tripledemic' </a> this fall and winter as cases of flu, RSV and COVID-19 infections collide.</p><p> Most professionals think that the RSV spike is because people are no longer wearing masks and social distancing, which caused a dramatic drop in RSV over the past two years.</p><p> Worldwide, RSV <a target='_blank' rel='noopener noreferrer'  href='https://www.niaid.nih.gov/diseases-conditions/respiratory-syncytial-virus-rsv#:~:text=Globally%2C%20RSV%20affects%20an%20estimated,causes%20160%2C000%20deaths%20each%20year.' > affects 64 million people </a> and causes 160,000 deaths each year. Understanding the symptoms of this illness, how to treat it, and who is at risk for a severe illness is important as we head into cold and flu season.</p><h2>What is RSV?</h2><p> Respiratory syncytial virus (RSV) is a common virus during cold season. It causes mild, cold-like symptoms in most people, but for some, it can be serious.</p><p> Those most at risk include seniors and infants. A serious case of RSV can cause bronchitis and pneumonia, even in babies under 1 year old.</p><p> The CDC <a target='_blank' rel='noopener noreferrer'  href='https://www.cdc.gov/rsv/research/us-surveillance.html'> offers some sobering statistics </a> . Each year, RSV results in:</p><ul> <li><p>2.1 million doctor visits among children under age 5</p></li><li> <p>58,000 hospitalizations and 100-300 deaths among children under age 5</p></li><li> <p>177,000 hospitalizations and 14,000 deaths among adults over age 65</p></li></ul><p> Understanding the symptoms can help you recognize and treat RSV quickly so that the illness doesn’t become more serious.</p><h2>Symptoms and treatment of RSV</h2><p> How do you know when someone has RSV? In many people, there are core symptoms to watch for. However, very young infants may not show these symptoms and may instead be irritable, have trouble breathing, and be less active.</p><p>Common symptoms include:</p><ul> <li> <p>Runny nose</p></li><li> <p>Coughing and sneezing</p></li><li> <p>Wheezing</p></li><li> <p>A fever</p></li><li> <p>Decreased appetite</p></li></ul><p> Most cases of RSV resolve on their own within one or two weeks. Because it’s a virus, there’s no specific treatment for the illness itself. However, if RSV leads to more serious conditions like bronchitis or pneumonia, seeing a doctor and getting additional medical help is vital.</p><h2>What to expect with RSV</h2><p> If you recognize symptoms of RSV, what can you expect as the illness progresses and resolves? We’ll answer some of the most commonly asked questions here.</p><p>How long does RSV last?</p><p> Most cases are mild and last between one and two weeks. If it becomes a serious issue like pneumonia, it may last longer and take longer to recover.</p><p>Is RSV contagious?</p><p> Yes, people who have RSV are usually contagious for <a target='_blank' rel='noopener noreferrer'  href='https://www.cdc.gov/rsv/about/transmission.html#:~:text=People%20infected%20with%20RSV%20are,as%20long%20as%204%20weeks.' > between three and eight days </a> . Infants and those with weaker immune systems can continue to spread the virus for up to a month. Children often get exposed to RSV at school or activities and then transmit it to other members of the family.</p><p> RSV germs can last on hard surfaces for several hours and on soft surfaces for an hour or more.</p><p>Who is most at risk with RSV?</p><p> Almost everyone gets a form of RSV in their lifetime, and generally the illness passes without incident. However, those most at risk for severe illness or complications include:</p><ul> <li> <p> Infants and young kids, especially preemies, and those with compromised immune systems or those who have had heart or lung disease since birth </p></li><li> <p>Adults with compromised immune systems</p></li><li> <p> Adults who are older, especially if they also have heart or lung disease </p></li></ul><p>When should you call the doctor about RSV?</p><p>Since most cases of RSV are mild, seeing a doctor isn’t always necessary.</p><p> However, call or visit a doctor right away if you or a family member are at risk for severe RSV and have the following symptoms: high fever, difficulty breathing, blue color to the skin (check the lips and nails especially) or dehydration. Also, watch for symptoms that are getting worse or aren’t improving after a week.</p><p> If you’re concerned about your child, yourself, or a family member, visiting an urgent care center can help ensure everything is okay and let you know if further treatment is needed.</p><h2>Get the treatment you need for RSV</h2><p> Because it’s a virus, a doctor can manage symptoms and help a patient get the oxygen they need while they fight off the illness. There’s no direct treatment that attacks or kills a virus.</p><br/><p> In late October, National Institute of Allergy and Infectious Diseases Director Dr. Anthony Fauci announced that U.S. officials are working on a respiratory syncytial virus (RSV) vaccine that could come within the next year or two.</p><br/><p> While RSV cases are typically mild, it still causes serious problems for millions of people a year. Don’t hesitate to visit Qcare if you’re concerned about symptoms in yourself or your family members.</p>"
    },
    {
        "id": "reduce-risk-for-copd",
        "image": "/img/blog/pexels-felicity-tai-7951249.jpg",
        "title": "How Women Can Reduce Their Risk for COPD",
        "subtitle": "Raising awareness this November about how to prevent and treat COPD",
        "content": "<p><p> Chronic obstructive pulmonary disease (COPD) is a lung disease that makes it hard to breathe. For decades, COPD was thought of as a man’s disease – but in recent years, the number of women with COPD is increasing. Today, more women die from COPD than men.</p><br/><p> World COPD Day is November 16, 2022. We’re raising awareness about COPD in women to help you save your lungs from a deadly disease.</p><br/><p> Find out how COPD affects women and what you can do to prevent it. You only get one set of lungs in your life – take the first step today to protect them.</p><h2> What Is COPD in Women?</h2><p> COPD is a condition that causes limited airflow in the lungs. It includes chronic bronchitis and emphysema.</p><p> In COPD, lung tissue becomes inflamed from long-term exposure to toxins. This makes it hard for air to move in and out of the lungs. It also makes it hard for the lungs to get rid of carbon dioxide. This is the gas that is released when you breathe out.</p><p> The main symptom of COPD is dyspnea, or difficulty breathing. Other <a target='_blank' rel='noopener noreferrer'  href='https://www.lung.org/lung-health-diseases/lung-disease-lookup/copd/symptoms-diagnosis' > symptoms </a> include:</p><ul> <li> <p> Chronic cough </p></li><li> <p> Excessive mucus production </p></li><li> <p> Shortness of breath </p></li><li> <p> Getting tired easily </p></li><li> <p> Bluish lips or nail beds </p></li><li> <p> Frequent respiratory infections </p></li></ul><p> People with COPD struggle to live active lives. Everyday activities make you feel “winded” and easily tired. Many people with severe COPD can’t function normally – it’s the leading cause of disability and death in the U.S.</p><p> COPD is a chronic disease, meaning people learn to live with it. Although there is no cure, it’s a preventable and treatable illness. Here’s how you can prevent and manage COPD to live your most active life.</p><h2> How Does COPD Affect Women?</h2><p> The American Lung Association estimates more than <a target='_blank' rel='noopener noreferrer'  href='https://www.lung.org/lung-health-diseases/lung-disease-lookup/copd/learn-about-copd' > 125 million </a> people in the U.S. have COPD. It was originally most common among male smokers.</p><p> Because COPD was thought to be a man’s disease, women have been largely underdiagnosed. Their symptoms may have been overlooked or not screened for at all.</p><p> Now, the number of men diagnosed with COPD is decreasing – but for women, the number continues to rise.</p><p> Many women aren’t diagnosed with COPD because they don’t realize they have symptoms. To prevent severe lung disease, it’s important to be familiar with the symptoms and warning signs of COPD.</p><p>How does COPD impact women differently than men? A 2018 <a target='_blank' rel='noopener noreferrer'  href='https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6171761/'>study</a> found that women with COPD have more burden from the disease than men.</p><p> In the study, women with COPD had more trouble breathing than men. They had more trouble moving air and more COPD flare-ups. Experts believe it’s because women’s lungs handle toxins differently than men's. Research showsthat female smokers are <a target='_blank' rel='noopener noreferrer'  href='https://www.cdc.gov/copd/basics-about.html'>more likely</a> to get COPD at a young age than males.</p><h2> What Causes COPD?</h2><p> Smoking is the leading cause of COPD, but there are other risk factors women should be aware of. Here are the possible <a target='_blank' rel='noopener noreferrer'  href='https://www.lung.org/lung-health-diseases/lung-disease-lookup/copd/what-causes-copd#:~:text=Approximately%2085%20to%2090%20percent,Exposure%20to%20air%20pollution' > causes </a> of COPD:</p><ul> <li> <p> Smoking. 85-90 percent of people diagnosed with COPD are cigarette smokers. </p></li><li> <p> Environmental toxins. Breathing in toxins over a long period of time increases your risk of lung disease. You may be exposed to toxins from air pollution, secondhand smoke, and chemicals (for example, in the workplace). </p></li><li> <p> Alpha-1 deficiency. A protein called alpha-1 protects the lungs. Some people with COPD are born with a genetic condition that causes a lack of alpha-1. </p></li></ul><h2> How Is COPD Diagnosed and Treated?</h2><p> If you’re experiencing any of the symptoms of COPD, talk to your doctor. Many women don’t realize symptoms like feeling winded can be a warning sign for COPD.</p><br/><p> Doctors diagnose COPD by reviewing your health history and running a series of tests. The purpose of testing is to look at how your lungs are functioning.</p><br/><p> In a test called <a target='_blank' rel='noopener noreferrer'  href='https://www.lung.org/lung-health-diseases/lung-procedures-and-tests/spirometry' >spirometry</a>, your doctor will have you blow into a machine. The machine tells how easily and quickly you move air through your lungs. It can tell how big of a breath you take.</p><br/><p> Other <a target='_blank' rel='noopener noreferrer'  href='https://www.mayoclinic.org/diseases-conditions/copd/diagnosis-treatment/drc-20353685' > lab tests </a> to diagnose COPD include:</p><br/><ul> <li> <p> Alpha-1-antitrypsin deficiency test. Alpha-1 deficiency is one of the causes of COPD, especially in people diagnosed at a young age. Your doctor may recommend this test if you have a family history of COPD. </p></li><li> <p> Arterial blood gas. This test tells how much oxygen is in the blood that is pumping to your organs. The test measures gas exchange by checking for too much CO2. </p></li><li> <p> Chest X-ray. This picture gives your doctor a closer look at your lungs. </p></li></ul><br/><p> Treating COPD means managing a chronic condition. You may be prescribed medications to help you breathe or to reduce the number of flare-ups. Some people with COPD need to be on oxygen all the time.</p><br/><p> A lung specialist may recommend pulmonary rehab. This type of program helps people with COPD live a more active life. It gives people education, nutrition advice, and exercise training to manage COPD. <br/> <br/></p><h2> How to Reduce Your Risk of COPD</h2><p> The number one way to prevent COPD is to stop smoking – or if you're a nonsmoker, don’t start. Keep in mind, secondhand smoke is a leading cause of COPD. If you live with a smoker, encourage them to stop smoking or go outside to smoke.</p><p> You can prevent COPD by being aware of the toxins in your environment. Wear a mask If you work in a setting where you’re exposed to lots of chemicals.</p><p> Talk to your doctor if you’re at risk for developing COPD or have any of the symptoms. Knowing the warning signs of COPD can help you catch it early.</p><p> Your lungs are what keep you breathing – take care of them today by knowing the warning signs of COPD and getting screened.</p><br/><br/><br/><br/><p> Sources</p><br/><ol> <li> <p> <a target='_blank' rel='noopener noreferrer'  href='https://www.lung.org/lung-health-diseases/lung-disease-lookup/copd/symptoms-diagnosis' > What are COPD symptoms? </a> </p></li><li> <p> <a target='_blank' rel='noopener noreferrer'  href='https://www.lung.org/lung-health-diseases/lung-disease-lookup/copd/learn-about-copd' > Learn about COPD </a> </p></li><li> <p> <a target='_blank' rel='noopener noreferrer'  href='https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6171761/'> Women manifest more severe COPD symptoms across the life course </a> </p></li><li> <p> <a target='_blank' rel='noopener noreferrer'  href='https://www.cdc.gov/copd/basics-about.html'> Basics about COPD </a> </p></li><li> <p> <a target='_blank' rel='noopener noreferrer'  href='https://www.lung.org/lung-health-diseases/lung-disease-lookup/copd/what-causes-copd#:~:text=Approximately%2085%20to%2090%20percent,Exposure%20to%20air%20pollution' > COPD causes and risk factors </a> </p></li><li> <p> <a target='_blank' rel='noopener noreferrer'  href='https://www.lung.org/lung-health-diseases/lung-procedures-and-tests/spirometry' > What Is Spirometry and Why It Is Done </a> </p></li><li> <p> <a target='_blank' rel='noopener noreferrer'  href='https://www.mayoclinic.org/diseases-conditions/copd/diagnosis-treatment/drc-20353685' > COPD- diagnosis and treatment </a> </p></li></ol><br/><br/><a target='_blank' rel='noopener noreferrer'  href='https://www.lung.org/lung-health-diseases/lung-disease-lookup/copd'> https://www.lung.org/lung-health-diseases/lung-disease-lookup/copd</a>"
    },
    {
        "id": "do-i-have-a-concussion",
        "image": "/img/blog/pexels-alex-green-5699864.jpg",
        "title": "Do I Have a Concussion?",
        "subtitle": "Did you know millions of people in the U.S. get a concussion each year, but half go undetected? Know the signs and treatment for concussions from our New York City urgent care mobile stations. Make an appointment if you think you or your child might have a concussion.",
        "CTA": "true",
        "content": "<p>Signs, symptoms and steps to recovery from New York City’s mobile urgent care stations</p><p>Millions of people get concussions every year, but <a target='_blank' rel='noopener noreferrer'  href='https://www.upmc.com/services/sports-medicine/services/concussion/about/facts-statistics#:~:text=Between%201.7%20and%203%20million,concussions%20go%20unreported%20or%20undetected.'>half go undetected</a>. That’s dangerous because a concussion can have serious consequences, especially if they happen repeatedly.</p><p>If you’ve hit your head and now you have a headache, should you go to urgent care or visit a doctor? It’s better to be safe than sorry, but if you have a better understanding of headaches and the symptoms of a concussion, you’ll be able to make an informed decision.</p><p>Here’s how to recognize a concussion if you have one.</p><h2>Common Causes of Concussions</h2><p>A concussion happens when your head is jarred or impacted hard enough that the fluid surrounding your brain isn’t enough to cushion it, so the brain hits the inner walls of the skull. This can affect your brain function for at least a few days and sometimes longer.</p><p>Many people are aware that football players frequently suffer concussions from the hard hits of their sport. Many youth soccer leagues in recent years banned headbutting. However, head injuries can happen in everyday situations as well.</p><p>Generally, concussions occur due to a blow to the head or violent shaking of the head or upper body. This can happen:</p><p>● In a car accident</p><p>● In an accidental collision with another person while walking or running</p><p>● From a fall</p><p>● Hitting your head on a cabinet, door, or another object</p><p>● During sports such as soccer, football, and other contact sports</p><p>If you’ve had a recent concussion, an additional impact to the head is <a target='_blank' rel='noopener noreferrer'  href='https://concussion.weillcornell.org/am-i-now-greater-risk-another-concussion#:~:text=Yes%2C%20there%20is%20an%20increased,recovery%20of%20the%20first%20concussion.'>more likely to cause another one</a>.</p><h2>Warning Signs of a Concussion</h2><p>How do you know if you’re suffering from a concussion or just have a normal headache?</p><p>First, it’s important to dispel the myth that you must lose consciousness to get a concussion. You may not lose consciousness at all and yet have serious symptoms that last days or weeks.</p><p>If you’ve hit your head or had your head or neck seriously jarred, you’re at risk for a concussion, especially if you now have a headache or pressure in your head that is acute or persistent.</p><p>Other symptoms of concussions include:</p><p>● Ringing in your ears</p><p>● Nausea or vomiting</p><p>● Loss of memory, especially of the event that caused the concussion</p><p>● Confusion, fatigue or a foggy feeling</p><p>● Blurry vision, dizziness or balance problems</p><p>● Problems with concentration or memory</p><p>● Irritability and personality changes</p><p>● Problems sleeping</p><p>● Sensitivity to light and noise</p><p>● Depression and psychological problems</p><p>● Taste and smell problems</p><p>Keep in mind that these symptoms may not start immediately after the injury. Symptoms can begin to appear several days afterward.</p><p>Even if you’re not experiencing any immediate symptoms, if you know you’ve had a head injury, it’s helpful to go to urgent care or the doctor for an exam. If you’re struggling with significant symptoms, go quickly to the Emergency Department.</p><h2>Concussions in Children</h2><p>The symptoms of a concussion in a young child or infant can be different, especially since they don’t express themselves in the same way.</p><p>If you notice the following signs of a concussion, it’s important to take your child to a doctor:</p><p>● Looking dazed</p><p>● Being listless or tiring quickly</p><p>● Unsteady walking and lack of balance</p><p>● Excessive crying, irritability, or crankiness</p><p>● Changes in eating or sleeping habits</p><p>● Losing interest in favorite activities or toys</p><p>● Vomiting</p><p>● Seizures</p><p>Even if your child isn’t exhibiting any symptoms right away, if you’re aware of a head injury, it’s important to take them to see the doctor or to urgent care. If they have significant symptoms, you’ll want to take them to the emergency department for immediate care.</p><h2>When to See a Doctor or Visit Urgent Care</h2><p>Very simply, if you or your child has had a head injury beyond a mild bump, it’s important to see a doctor or visit urgent care within a day or two.</p><p>If you or your child have severe symptoms such as severe headache, vomiting, seizures, or increasing confusion, visit the Emergency Room as quickly as possible.</p><p>Even if a concussion is minor it can impact how your brain functions and put you at risk for additional concussions if you hit your head again in the near future.</p><h2>Concussion Treatment and Length</h2><p>Do not take pain medication directly after a concussion, as that can worsen bleeding and mask symptoms. Treatment for a concussion generally involves physical and mental rest.</p><p>Gradually, you’ll ease back into your daily activities. Pay attention to how you feel and back off an activity when it worsens your symptoms.</p><p>Limit activities that trigger concussion symptoms, which may include:</p><p>● Looking at your smartphone screen</p><p>● Reading</p><p>● Watching television</p><p>● Playing video games</p><p>● Listening to loud music</p><p>● Physical activity</p><p>Over time, your symptoms will improve, and you can resume more and more of your usual daily routine. There’s no set recovery period for a concussion, so be sure to watch your symptoms carefully.</p><h2>Get the Care You Need for a Concussion</h2><p>Concussions can be very serious, so be sure to go to Qcare or see your doctor within a day or two of a head injury or impact. If you have serious symptoms, go to an Emergency Department for immediate help.</p><p>Worried about a concussion? We can help. Contact us to make an appointment today!</p><div><br/></div>"
    },
    {
        "id": "avoid-food-poisoning-this-holiday-season",
        "image": "/img/blog/pexels-andrea-piacquadio-3808005.jpg",
        "title": "How to Avoid Food Poisoning This Holiday Season",
        "subtitle": "Holiday parties are no longer fun when a guest gets food poisoning. Know how to prevent food poisoning and how to treat it from our New York City urgent care. Make an appointment if you think you or a family member may be dehydrated from food poisoning.",
        "CTA": "true",
        "content": "<p> ‘Tis the season for holiday cheer… and potlucks, and inexperienced cooks trying their hand at turkey, pudding, and more.</p><p> While we all love the food and festivity of the holidays, the fun stops when guests go home with food poisoning. Everyone means well, but not everyone knows how to cook food to the right temperature, store food properly, and other safety techniques. Food poisoning is more common during holiday seasons when hosts are preparing large quantities of food ahead and reheating it in time to serve.</p><p> It’s up to each of us to use proper methods for cooking and storing food and to watch for signs that food may not be safe. Here are some tips to help you avoid food poisoning.</p><h2>4 Ways to Prevent Food Poisoning</h2><p> The unfortunate truth is that both bacteria and viruses can spread through food, making us ill. The good news is that you can take steps to prevent food poisoning.</p><h3>Store Uncooked Food Separately</h3><p> Keeping raw meats separate from other food — and from each other — is an important way to stay healthy during the holidays.</p><p> You also want to keep meats and other foods separate in your shopping cart and use different cutting boards for meats and other foods to keep the meat juices from contaminating other items.</p><p> If you see that something has been tainted, throw it out to avoid food poisoning.</p><h3>Keep Your Hands and Work Surfaces Clean</h3><p> It’s not just meat juices that can carry germs around your kitchen. Your hands, counters, and utensils can as well.</p><p> Make sure you’re washing your hands thoroughly regularly and carefully wash all preparation surfaces as well.</p><p>Other important times to wash up include:</p><p>● Before you eat</p><p>● After touching pets or handling pet food or treats</p><p> ● After using the toilet, changing a diaper, or cleaning up a child who used the toilet</p><p> ● Before and after coughing, sneezing, treating a cut or wound, or caring for someone who is ill</p><h3>Cook Food to the Right Temperature</h3><p> If you don’t have a reliable food thermometer, that’s the first thing you should buy before you prepare food for yourself or others. A digital thermometer is inexpensive and can tell you when you’ve cooked food to a safe temperature.</p><p> What are the <a target='_blank' rel='noopener noreferrer'  href='https://www.foodsafety.gov/food-safety-charts/safe-minimum-internal-temperatures' >safe temperatures</a> ?</p><p>● Beef: 145℉ and a three-minute rest</p><p>● Ground beef or pork: 160℉</p><p>● Poultry: 165℉</p><p>● Eggs: until yolk and white are firm, or 160℉ for casseroles</p><p>● Reheating precooked ham: 165℉</p><p>● Pork steaks, chops, or roasts: 145℉ and a three-minute rest</p><h3>Keep Food Out of the Temperature “Danger Zone”</h3><p> You want to avoid having food in the 40℉ to 140℉ “danger zone” that allows bacteria to multiply quickly.</p><p> Hot food should be put away between 30 minutes and two hours after cooking. Cold food should be refrigerated less than two hours after being served.</p><p> If you notice that food has been sitting out for long, be sure to say something to the host and encourage them to put it away. That way, everyone can avoid food poisoning!</p><h2>Is There Treatment For Food Poisoning Once it Starts?</h2><p> Call your doctor or urgent care if you’re sick with food poisoning. Your doctor will ask a lot of questions about where you’ve been and what you’ve eaten and also perform tests to determine what organism is causing it.</p><p> It could be any number of different types of bacteria or viruses, and the doctors also want to find out if there’s a particular source of the illness so others can be notified. If a specific organism or source of illness is found, the treatment will focus on eradicating it.</p><p> <a target='_blank' rel='noopener noreferrer'  href='https://www.niddk.nih.gov/health-information/digestive-diseases/food-poisoning/treatment' >Common treatments</a> for food poisoning include:</p><p>● Replacing lost fluids</p><p> ● Antibiotics, although these are not appropriate for all types of food poisoning</p><p>● Rest</p><p>● Easing back into eating</p><p> As you can see, there’s no slam-dunk treatment that makes your illness go away. That’s why it’s so important to take steps to avoid food poisoning.</p><h2>When to Visit Urgent Care For Food Poisoning</h2><p> While food poisoning often goes away on its own, there are times you will want to get medical treatment.</p><p> If you’re experiencing symptoms of dehydration like dry mouth, extreme thirst, dark concentrated urine, rapid heartbeat or low blood pressure, lightheadedness, or confusion, come to Qcare urgent care right away. We can help you get the fluids you need to continue your recovery.</p><p>You’ll also want to see a doctor if:</p><p>● You’ve been very sick for more than 48 hours</p><p>● There’s blood in your vomit or poop</p><p>● Extreme cramps</p><p>● Fever of 102℉ or more</p><p>● Blurry vision, tingling in your arms, or muscle weakness</p><p> Certain people are more at risk from food poisoning, including those 60 and older, babies and children, pregnant women, and those with a weakened immune system. Those people should see a doctor at the first sign of this illness.</p><p> Do you need to schedule an appointment with Qcare urgent care? We’re here for you. Contact us today or visit one of our clinics for help.</p>"
    },
    {
        "id": "what-you-need-to-know-about-pneumonia",
        "image": "/img/blog/pexels-vlada-karpovich-5790716.jpg",
        "title": "Is it Pneumonia? What You Need to Know",
        "subtitle": "With RSV, COVID-19 and the flu expected to all affect New Yorkers this winter, it’s important to understand when and how these can turn into a case of pneumonia. This winter, our New York City quick care team is reminding you to know when to visit your doctor.",
        "content": "<p>Signs and Symptoms of Pneumonia and When to Seek Care</p><p> With RSV, COVID-19 and the flu expected to all affect New Yorkers this winter, it’s important to understand when and how these can turn into a case of pneumonia. According to the CDC, in 2018 <a target='_blank' rel='noopener noreferrer'  href='https://www.cdc.gov/dotw/pneumonia/index.html' >1.5 million Americans</a > were diagnosed with pneumonia, and 40,000 died from the disease.</p><p> What are the signs of pneumonia, and can you treat pneumonia at urgent care? The answers to these questions will help you get the care you need to fight off pneumonia successfully.</p><h2>What Causes Pneumonia?</h2><p>Pneumonia can be caused by a virus, bacteria, or even fungi.</p><p> Bacterial pneumonia is most commonly caused by streptococcus pneumoniae and can impact a small area of your lungs or all of both lungs.</p><p> A virus causes about one-third of all pneumonia cases, which can include a variety of viruses, such as the flu. Generally, viral pneumonia is not as serious as bacterial pneumonia and will heal more quickly.</p><p> Fungi from dirt or bird droppings can cause pneumonia if there is heavy exposure.</p><h3>Common Types of Pneumonia</h3><p> There are over 30 types of pneumonia, and they are categorized by cause. That means the most common types of pneumonia are bacterial and viral pneumonia.</p><p> The treatment you receive will depend on the type of pneumonia you’re diagnosed with.</p><h2>Signs and Symptoms of Pneumonia</h2><p> Pneumonia is an infection that causes the air sacs in one or both lungs to fill with fluid and become inflamed. You may experience coughing with phlegm, fever, chills, and trouble breathing.</p><p>The most common symptoms include:</p><p>● A cough with yellow, green, or bloody mucus</p><p>● Bluish color to lips and fingernails</p><p>● Heavy sweating</p><p>● Fever</p><p>● Trouble breathing or breathing rapidly</p><p>● Extreme fatigue</p><p>● Sharp or stabbing pain when breathing or coughing</p><h3>When to go to Urgent Care for Pneumonia</h3><p> When should you see a doctor for pneumonia? Can you treat pneumonia at urgent care, or do you need to see your regular doctor?</p><p> If you experience symptoms including chest pain, trouble breathing, a persistent fever over 102, or a cough that doesn’t go away, you should see a doctor. Fortunately, professionals can treat pneumonia at an urgent care center, so you don’t have to wait to see your regular doctor.</p><p> It’s also important to see a doctor quickly if you’re at a higher risk of complications or serious illness, which includes infants and children under2, adults over age 65, smokers, and those with chronic medical conditions such as lung and heart issues.</p><h3>What to Expect When Your Child Gets Pneumonia</h3><p> Seeing your child sick is hard for parents, and you want to get them the best care you can. As with adults, <a target='_blank' rel='noopener noreferrer'  href='https://www.cedars-sinai.org/health-library/diseases-and-conditions---pediatrics/p/pneumonia-in-children.html' >childhood pneumonia</a > can be mild or severe. It’s most common in kids under the age of five.</p><p> Children may experience coughing, pain while coughing, fever, fatigue, loss of appetite and vomiting or diarrhea when they have pneumonia. If the cause is a virus, symptoms may develop more slowly.</p><p> You’ll want to take your child to the doctor to make sure you get an accurate diagnosis since some of these symptoms occur with other illnesses as well.</p><h2>How to Prevent and Treat Pneumonia</h2><p> To prevent pneumonia, you want to limit your exposure to the bacteria and viruses that cause it. That means getting your annual flu shot, talking to your doctor about getting specific pneumonia vaccines and practicing good cleanliness.</p><p> It’s also important to keep your immune system strong by eating healthy food, exercising, and getting the sleep you need. Finally, avoid smoking, as it compromises your lungs and makes you susceptible to illness.</p><p> If you do get pneumonia, it will be treated based on the cause. For bacterial pneumonia, the doctor will give you antibiotics. For viral pneumonia, there’s no specific treatment other than resting, getting lots of fluids, and using over-the-counter medication to control coughing and pain until the pneumonia heals on its own.</p><p> In some cases, pneumonia can cause serious lung infections and breathing problems. In those cases, you may need to be hospitalized and monitored until the illness clears. You might need breathing assistance, temperature control, and more.</p><p> Children may be hospitalized if they are under two months old, are excessively tired, appear dehydrated, or have trouble breathing or low oxygen levels. Medical assistance can help them stay stable until the illness goes away.</p><h2>Get the Care You Need For Pneumonia</h2><p> If you are worried that you might have pneumonia, it’s important to seek care and treatment. Fortunately, doctors can treat pneumonia at urgent care, so you can make an appointment and be seen right away.</p><p>If you need to make an appointment, we’re here to help. Contact us today!</p>"
    },
    {
        "id": "nyc-officials-announce-mask-advisory-again",
        "image": "/img/blog/pexels-anna-shvets-3902732.jpg",
        "title": "NYC Officials Announce Mask Advisory…Again",
        "subtitle": "Tips to get through this winter’s viral season of ‘tripledemic’",
        "content": "<p> New York City officials this weekend announced a mask advisory as the pandemic enters its third winter. Faced with a triple threat of respiratory viruses, NYC Health Commissioner Dr. Ashwin Vasan says the city's health office is recommending masks, vaccinations and boosters.</p><br/><p> The new mask advisory is an effort to reduce the spread of COVID-19, flu and RSV. The advisory strongly urges that all individuals over the age of two should wear a face covering when in any indoor public space or outdoor public space where social distancing is not possible.</p><br/><blockquote class='twitter-tweet'> <p lang='en'> Today <a target='_blank' rel='noopener noreferrer'  href='https://twitter.com/NYCHealthCommr?ref_src=twsrc%5Etfw' >@NYCHealthCommr</a > issued an advisory as NYC faces high levels of COVID-19, flu and RSV. New Yorkers are strongly urged to wear masks in public indoor settings and crowded outdoor settings: <a target='_blank' rel='noopener noreferrer'  href='https://t.co/oDvGGLKxrI'>https://t.co/oDvGGLKxrI</a> <a target='_blank' rel='noopener noreferrer'  href='https://t.co/X3Xsun6kTG'>pic.twitter.com/X3Xsun6kTG</a> </p>&mdash; nychealthy (@nycHealthy) <a target='_blank' rel='noopener noreferrer'  href='https://twitter.com/nycHealthy/status/1601276303143051266?ref_src=twsrc%5Etfw' >December 9, 2022</a ></blockquote><script async src='https://platform.twitter.com/widgets.js' charset='utf-8'></script><br/><p> Throughout the country, major cities, including NYC, are seeing a spike in respiratory cases in what many are saying may be our new normal. Flu, RSV and COVID-19 cases are up, including an increase in hospitalizations. Cases for RSV, which spiked this fall, may have already peaked. CDC Director Rochelle Walensky says hospitalizations from cases of the flu are the highest the agency has seen at this time of year in a decade.</p><br/><p> <img src='/img/blog/mask-blog-content.png' width='624' height='267'/></p><p> Source: <a target='_blank' rel='noopener noreferrer'  href='https://covid.cdc.gov/covid-data-tracker/#county-view?list_select_state=New+York&amp;data-type=CommunityLevels&amp;null=CommunityLevels' > CDC Data Tracker </a></p><br/><br/><h1>RSV vs. flu vs. COVID-19</h1><br/><p> Symptoms from RSV, flu and COVID-19 can be similar. The best way to know your diagnosis is to get tested at a clinic, like Qcare. Following are some differences between the three viruses.</p><br/><p> RSV: Respiratory Syncytial Virus (RSV) is a virus that is common in infants and young children and is one of the most common causes of lower respiratory tract infections such as bronchiolitis and pneumonia.</p><br/><p> Symptoms of RSV are similar to a cold and include fever, runny nose, cough and difficulty breathing. Cases are typically mild, but RSV can result in hospitalization.</p><br/><p> When cases of the virus spike in general, as it did in late October and early November, severe cases spike as well. Infants and seniors are at a higher risk of hospitalization from RSV.</p><br/><p> Flu: The flu, or Influenza, is a contagious respiratory virus caused by the influenza virus. Symptoms of the flu include fever, chills, body aches, sore throat, runny nose, coughing, and fatigue.</p><br/><p>The flu can be serious and can even lead to death.</p><br/><p> COVID-19: COVID-19 is a virus caused by the SARS-CoV-2 virus. Symptoms of COVID-19 can range from mild to severe, including fever, cough, cold symptoms, shortness of breath, loss of taste or smell, fatigue and body aches.</p><br/><p> In severe cases, COVID-19 can cause difficulty breathing or severe symptoms. Go to the emergency room if you are experiencing difficulty breathing.</p><br/><h2>One test panel covers flu, RSV or COVID-19</h2><br/><p> At Qcare mobile urgent care stations, located throughout New York City, we offer four tests with just one swab: COVID PCR, flu A &amp; B and RSV. There is no out-of-pocket cost for symptomatic patients.</p><br/><p> Similarly to COVID-19 testing, testing for the flu, RSV and COVID-19 panel is done with a nasal swab.</p><br/><br/><h3>When to go to urgent care for flu, RSV or COVID-19</h3><br/><p> When it comes to deciding whether to go to urgent care for the flu, RSV, or COVID-19, it’s important to consider your symptoms and the severity of your condition.</p><br/><p> If you have any of the following symptoms, you should seek medical attention at an urgent care center for flu, RSV or COVID-19:</p><p>• High fever (over 100.4°F)</p><p>• Difficulty breathing</p><p>• Chest pain</p><p>• Severe muscle or body aches</p><p>• Severe or persistent vomiting</p><p>• Dizziness or confusion</p><p>• Severe fatigue</p><p>• Loss of appetite</p><p>• Severe abdominal pain</p><br/><p> If you have any of the above symptoms and are not sure whether you should seek treatment, it’s best to err on the side of caution and go to an urgent care center, like Qcare.</p><br/><p> It is also important to remember that you should not go to the emergency room unless you are having an emergency. In addition to the above symptoms, it is also important to consider the severity of your condition.</p><h2>What masks offer the best protection?</h2><p> Wearing a mask in indoor spaces helps protect you and your loved ones, while preventing the spread of respiratory viruses. Some masks are more effective than others.</p><br/><p> 1. Cloth Face Masks: Cloth face masks are one of the most popular and affordable options for COVID-19 protection. They are effective at trapping droplets from coughs and sneezes and can be washed and reused.</p><br/><p> 2. N95 Masks: N95 masks are the most effective for protecting against COVID-19. These masks are designed to filter out 95 percent of airborne particles and are especially effective against the coronavirus.</p><br/><p> 3. KN95 Masks: KN95 masks are similar to N95 masks, but are made to meet Chinese standards. They are also effective against COVID-19, and are considered to be slightly less effective than N95 masks. This is because an N95 respirator has straps that go around the head to ensure a tight seal, while a KN95 respirator has ear loops.</p><br/><br/><p> 4. Surgical Masks: Surgical masks are designed to protect against droplets and other large particles and are often used in medical settings. They are not as effective as N95 or KN95 masks, but they can still provide some protection against Covid-19.</p><br/><p> 5. Face Shields: Face shields provide full face protection and help to reduce the spread of COVID-19 by blocking droplets from entering the eyes, nose, and mouth. They are not as effective as masks, but they can provide additional protection</p><br/><h2>How to safely wear a mask</h2><br/><p> It’s important to remember the proper way to wear a mask for the most effectiveness.</p><br/><p>1. Wash your hands before putting on a mask.</p><br/><p>2. Make sure the mask fits snugly and covers your nose and mouth.</p><br/><p>3. Avoid touching the mask while wearing it.</p><br/><p>4. Make sure to replace the mask if it becomes damp or soiled.</p><br/><p> 5. When taking off the mask, do not touch the front of the mask. Instead, remove it from the straps or ties.</p><br/><p>6. After taking off the mask, wash your hands or use hand sanitizer.</p><br/><h2>5 ways to get kids to wear a mask</h2><br/><p> 1. Make sure to explain to your children why masks are important for their health and for the health of those around them.</p><br/><p> 2. Show your children examples of other people wearing masks, such as family members, friends, or characters from TV shows or movies.</p><br/><p> 3. Find fun masks that your kids can wear. Many stores now have masks with fun designs or even masks featuring their favorite characters.</p><br/><p> 4. Create a reward system for your kids. Offer to give them a small reward or a sticker chart for each time they wear a mask.</p><br/><p> 5. Make sure to set a good example by wearing a mask yourself. Kids are more likely to follow your example than your words.</p><br/><br/><p> For fast, accurate testing for COVID-19, flu or RSV, visit a Qcare mobile station near you. You can make an appointment ahead of time or simply walk in.</p>"
    },
    {
        "id": "urgent-care-emergency-room-or-doctors-office",
        "image": "/img/blog/covid-recovery-center-female-doctor-holding-older-patient-hands.jpg",
        "title": "Urgent Care, Emergency Room or Doctor's Office?",
        "subtitle": "When you need a doctor fast, know when to visit your PCP, urgent care or an emergency room. Here’s your comprehensive guide from our New York City urgent care mobile stations.",
        "CTA": "true",
        "content": "<p> When you’re busy, there’s never a good time to get sick or injured. Needing a doctor on the weekends or after hours is even more inconvenient.</p><br/><p> Many people default to the emergency room because it’s the most well-known place to get medical help. However, there are other options that will save you both time and money. For example, you could schedule a regular doctor’s appointment or go visit an urgent care clinic.</p><br/><p> Knowing when to go to urgent care, schedule an appointment with your doctor or go to the emergency room is important. This guide will answer common questions so you always know where to go when you need medical help.</p><br/><p> Whether you’re dealing with an ear infection or swollen ankle, here’s a guide to know how to get the best medical care in every common scenario.</p><h2>When to Visit Your Doctor</h2><p> If you can wait a few days to get care, start by seeing when your primary care provider (PCP) has openings. The reason this is a great starting point is that your primary doctor already knows your history, what treatments have been tried, and other important details about your needs.</p><p> Instead of having to explain everything from the beginning, or get a full round of tests, you can skip to exactly what’s going on right now. Having a strong relationship with your PCP can also help you get the referrals you need to specialists and can make getting coverage through your health insurance easier.</p><p> When you can take care of your health by visiting your PCP, you’ll pay less out-of-pocket and have a knowledgeable partner guiding your health journey.</p><div className='text-center py-8'><a href='/locations' className='btn-primary text-blue-primary border-blue-primary border-2 uppercase hover:bg-blue-logo-secondary hover:border-blue-logo-secondary hover:text-white'> Book an Appointment</a></div><h2>When to Visit Urgent Care</h2><p> When you have symptoms that need immediate care or your PCP doesn’t have any opening, visit Qcare urgent care. You can make an appointment at a mobile station near you or walk right in. If these symptoms are not life-threatening, you’ll save time and money by going to an urgent care instead of the emergency room.</p><p> Urgent care centers are open seven days a week, and many are open late into the evening. You’ll pay <a target='_blank' rel='noopener noreferrer'  href='https://www.debt.org/medical/emergency-room-urgent-care-costs/'> an average of $100-$150 </a> rather than the $1,000 or more it costs to go to an emergency room.</p><p> On top of that, you can simply walk into an urgent care clinic — while you can schedule an appointment for faster service, it’s not required.</p><p>Urgent care centers can manage a lot of health conditions, including:</p><p>● Illnesses</p><p>● Burns, cuts and scratches</p><p>● Sprains, strains and broken bones</p><p>● Asthma and allergic reactions</p><p>● Falls</p><p>● Animal and bug bites</p><p>● Headaches</p><p> They also have tools for blood tests, x-rays, pregnancy tests, drug tests, testing for STDs and more. You can even get vaccinations, flu shots, gynecological exams and physicals at an urgent care center.</p><p> Now that you know when to visit urgent care, let’s look at the only time you should go to the emergency room — when you have a life-threatening condition.</p><h2>When to Go to the Emergency Room</h2><p> Studies show that up to <a target='_blank' rel='noopener noreferrer'  href='https://www.usnews.com/news/health-news/articles/2019-07-22/avoidable-er-visits-fuel-us-health-care-costs' > </a> <a target='_blank' rel='noopener noreferrer'  href='https://www.unitedhealthgroup.com/content/dam/UHG/PDF/2019/UHG-Avoidable-ED-Visits.pdf' > 66 percent of visits to the emergency department </a> could be handled elsewhere and that the cost to visit the emergency room is 12 times higher than visiting your regular doctor and 10 times higher than visiting urgent care.</p><p> Why pay so much more when you can get the same care for far less money at your doctor's office or urgent care?</p><p> In addition, when people use the emergency department for non emergencies, it inhibits the staff’s ability to effectively treat those with life-threatening conditions. That’s why it’s important to get your healthcare at the right clinic based on your needs.</p><p> When should you go to the emergency room? Only when you have a life-threatening emergency, such as:</p><br/><p>● Choking, difficulty breathing or stopped breathing</p><p>● Suffering from a head injury, especially with fainting or confusion</p><p> ● Suffering from a neck or spine injury, especially if there’s loss of feeling</p><p>● Electric shock or being hit by lightning</p><p>● Severe burns</p><p>● Chest pain or pressure</p><p>● Seizures</p><p>● A sudden, unusually bad headache</p><p>● Sudden weakness or drooping on one side of the body</p><p>● Heavy bleeding</p><p>● A broken bone protruding through the skin</p><p>● Poisoning or overdose from drugs or alcohol</p><br/><p> The emergency room is there to save lives and provide critical care that simply cannot wait for another medical provider.</p><h2>Choose Your Medical Provider Wisely</h2><p> You now know when to visit urgent care, a doctor or the emergency room. If you don’t have a life-threatening situation, avoid the emergency room so the staff there can focus on caring for those who do. Instead, work on getting an appointment with your primary doctor or going to an urgent care clinic.</p><p> An urgent care clinic can do many of the things we usually think of going to the emergency room for, including setting broken bones, testing for serious illness, and prescribing medication.</p><p> Save yourself a significant amount of time and money — make urgent care your default if your PCP is not available.</p>"
    },
    {
        "id": "common-causes-of-nausea",
        "image": "/img/blog/morning-sickness-young-pregnant-.jpg",
        "imgAlt": "How to treat nausea and avoid dehydration",
        "title": "Common Causes of Nausea (and When to See a Doctor!)",
        "subtitle": "Although nausea is common, there are times when it’s important to see a doctor. It can be a symptom of a more serious illness. It can also lead to dehydration and other concerns. Learn how to treat nausea at home from our New York City urgent care.",
        "CTA": "false",
        "content": "<p> We’ve all felt it — that rumbling in your stomach that makes you nervous that you might throw up. Nausea is a common symptom of several conditions, from pregnancy to the flu.</p><p> Although nausea is common, there are times when it’s important to see a doctor. It can be a symptom of a more serious illness. It can also lead to dehydration and other concerns.</p><p> What are the common causes of nausea and vomiting, and when should you take action? Here’s what you need to know.</p><h2>What Causes Nausea and Vomiting?</h2><p> There are several health conditions that can cause nausea and vomiting. Common causes of nausea include the following:</p><br/><p>● Food allergies or food poisoning</p><p>● Infections of the stomach, such as the “stomach flu”</p><p>● Pregnancy</p><p>● Motion sickness</p><p>● Concussion or migraines</p><p>● Emotional stress or fear</p><p>● Overeating</p><p>● Heart attack</p><p>● Some forms of cancer</p><p>● Bowel obstruction</p><p>● Ulcers</p><p> As you can see, the causes of nausea range from temporary and mild to serious, long-term illnesses. That’s why it’s important to keep an eye on your symptoms and get medical care when you need it.</p><h2>When Should I Be Concerned About Nausea and Vomiting?</h2><p>There are times when nausea and vomiting need medical care.</p><p> One of the most common is if you’re getting dehydrated. This is especially important in young children, who may not realize they’re dehydrated or be able to tell caregivers how they feel. Signs of dehydration include dry lips and mouth, sunken eyes and rapid breathing.</p><p>Other times to seek medical care include:</p><p>● Nausea or vomiting lasting more than a few days</p><p>● If a head injury has caused the illness</p><p>● If you see blood in the vomit</p><p>● If the ill person is lethargic or confused</p><p>● If there is severe abdominal pain</p><p> These additional symptoms mean that nausea could be a sign of something more serious.</p><h2>Why am I Nauseous But Not Vomiting?</h2><p> Not everyone who feels sick will actually vomit. For example, many people who struggle with motion sickness feel very nauseous but don’t always throw up. Stress, anxiety, headaches, and other ailments are other common causes of nausea without vomiting.</p><h2>How to Relieve and Prevent Nausea</h2><p> To relieve nausea quickly, drink ice-cold or clear drinks slowly. If you need to eat, choose bland, light foods such as crackers or toast. Avoid activity directly after eating, and get plenty of rest.</p><p> To prevent nausea, avoid things that you know are triggers for you feeling ill. You might take motion-sickness medication if you have to travel, or avoid flickering lights and strong odors. If food causes problems for you, make changes to your diet to avoid foods that make you feel ill. Spicy, high-fat, and greasy foods are often culprits.</p><p> You can also focus on eating food less likely to cause nausea, such as cereal, crackers, toast, and other mild foods.</p><h2>When to See a Doctor or Urgent Care</h2><p> If you notice symptoms that are a sign of something serious, such as the ones listed as concerns above, it’s important to see a doctor or go to urgent care.</p><p> An urgent care clinic can often get you in very quickly so you don’t have to wait several days until your doctor is available. Most causes of nausea and vomiting can be managed by urgent care.</p><p> If you suspect a life-threatening cause of illness, such as a heart attack or brain injury, you’ll want to call 911 or go to the emergency room right away.</p><h2>How to Treat Nausea</h2><p> If you’re feeling nauseous, you’ll want to take it easy and rest as much as possible. Drink very cold clear drinks, especially water. Gatorade can also be helpful to prevent dehydration.</p><p> Start with eating or drinking very small amounts and work your way up as you feel better.</p><p> If your nausea has a specific cause, such as a headache, medications that treat the cause can help with nausea as well. Pain medication, stomach-acid reducers or motion sickness medication can all make a difference.</p><h2>Take Care of Nausea With a Quick Care Visit Today</h2><p> Often, nausea and vomiting last only a day or two and you’re feeling better. But if that’s not the case, don’t hesitate to schedule an appointment with a Qcare mobile station.</p><p> The provider at Qcare will determine the cause of your nausea and help you start a treatment plan to recover.</p><p> If you’re dehydrated or have been nauseous or vomiting for more than a few days, don’t wait — schedule a Qcare visit today.</p><div> <br/></div>"
    },
    {
        "id": "hypertension-signs-and-treatment",
        "image": "/img/blog/pexels-thirdman-7659564.jpg",
        "imgAlt": "Signs and treatment for hypertension",
        "title": "Hypertension: What Are the Signs and Treatment?",
        "subtitle": "Understanding the signs of hypertension and how to get treated will help you stay in better health throughout your life.",
        "CTA": "false",
        "content": "<p> Hypertension — often referred to as high blood pressure — means that the force of the blood pushing against your arteries is too high. This makes your heart work harder to pump blood.</p><p> Your blood pressure changes throughout the day and will be higher when you respond to a stressful situation and lower when you’re resting. However, when it’s consistently over a certain level, you’re at risk of a serious health event such as a heart attack or stroke.</p><p> Understanding the signs of hypertension and how to get treated will help you stay in better health throughout your life.</p><h2>Common Causes of Hypertension</h2><p> High blood pressure is caused either by an increase in the amount of blood your heart is pumping or by a narrowing of the arteries. Both force your heart to work harder.</p><p> The most common cause of hypertension is a gradual buildup of plaque in the arteries, which increases the risk of consistently high blood pressure. However, there are sometimes other reasons for hypertension. These are known as secondary causes.</p><p>Secondary causes of hypertension include:</p><ul> <li> <p> Heart defects where your blood vessels are narrower than usual when you’re born </p></li><li> <p> Some medications, including certain cough and cold, pain relievers, birth control medications and others </p></li><li> <p>Cocaine or amphetamines</p></li><li> <p>Kidney disease</p></li><li> <p>Tumors on your adrenal glands</p></li><li> <p>Thyroid problems</p></li><li> <p>Obstructive sleep apnea</p></li><li> <p>Ongoing anxiety or chronic pain</p></li></ul><p> If your doctor notices high blood pressure, they’ll check the secondary causes first to ensure that it’s not a sign of something more serious.</p><br/><h2>How Do We Feel When BP is High?</h2><p> Most people don’t feel any different with hypertension. There are usually no symptoms until blood pressure reaches life-threatening levels.</p><br/><p> However, that doesn’t mean that high blood pressure can be ignored. Instead, work with your doctor to find a treatment plan to help you stay healthy.</p><p> If you haven’t had your blood pressure checked in a while, consider making an appointment with your doctor or urgent care today. A general checkup, including measuring your blood pressure, can help you discover health problems before they become serious.</p><h2>What are the Warning Signs of Hypertension?</h2><p> Many people with hypertension don’t have clear symptoms. The problem is typically discovered during a routine doctor’s appointment when blood pressure is higher than expected.</p><p> Sometimes hypertension will cause specific symptoms, such as nosebleeds, headaches and shortness of breath. However, these symptoms can occur in other situations as well and generally don’t occur until blood pressure is at life-threatening levels.</p><h2>What 3 Things Can Hypertension Cause?</h2><p> Left untreated, hypertension can cause three significant health problems. You could struggle with heart disease, suffer a heart attack or have a stroke.</p><p> Beyond those three core problems, hypertension can also damage your brain, eyes and kidneys, which can result in an aneurysm, vision loss, problems with metabolism and problems with memory – including dementia.</p><h2>When to See a Doctor or Visit Urgent Care</h2><p> It’s important to see your doctor for checkups regularly and get a blood pressure reading at least once every two years. As you get older, or if you have risk factors for hypertension, you may need your blood pressure checked more often.</p><p> If you receive a blood pressure reading of more than 180/120 mm HG, that’s considered a medical emergency, and you should seek immediate medical help.</p><p> If your blood pressure measures 140/90 or higher on multiple occasions, you’ll want to talk to your doctor about how to control your blood pressure through medication and lifestyle changes.</p><h2>What Are the 4 Categories of Blood Pressure?</h2><p> The four categories of blood pressure are the ranges that define if you have healthy blood pressure, if the pressure is elevated, or if you have Stage 1 or Stage 2 hypertension.</p><p>The four categories are defined based on blood pressure ranges:</p><ul> <li> <p>Healthy: 120/80 mm Hg or lower</p></li><li> <p>Elevated: Top number between 120-129, bottom is 80 or below</p></li><li> <p> Stage 1 Hypertension: Top number is between 130 - 139 or the bottom number is between 80 and 89 </p></li><li> <p> Stage 2 Hypertension: Top number is 140 or higher or the bottom number is 90 or higher </p></li></ul><p> Knowing which of these four categories you fall into is important so that you can properly manage your health and protect your heart, lungs, and brain.</p><h2>Can Hypertension Be Cured?</h2><p> There is no cure for hypertension, but there are steps you can take to lower your blood pressure and help it stay at a healthy level.</p><p> Working with your doctor is important so that you get a treatment plan that works well for you. This may include medication, lifestyle changes, or both.</p><p> What’s important is to continue your treatment even if you feel fine, because high blood pressure can cause damage even without symptoms. Keeping your blood pressure consistently within the right range is essential.</p><p> Don’t wait — make an appointment to check on your blood pressure and any other wellness practices of care at a Qcare mobile station today!</p>"
    },
    {
        "id": "heart-attack-symptoms-men-v-women",
        "image": "/img/blog/pexels-freestocksorg-128597.jpg",
        "imgAlt": "Signs of a heart attack",
        "title": "Heart Attack Symptoms: Men vs Women",
        "subtitle": "Heart attacks symptoms differ in men vs. women. Learn from our New York City mobile care stations the signs of a heart attack and when to get help.",
        "CTA": "false",
        "content": "<p> When we learn the signs of a heart attack, we’re usually told about chest pain. While that’s common, there are far more symptoms of a heart attack. These symptoms can vary in men vs women.</p><p> As a result, it’s easy for a woman and clinicians to miss the signs of a heart attack, which can have deadly consequences. Understanding the different heart attack symptoms between men and women can help everyone better understand the warning signs and seek help quickly.</p><h2>Are Heart Attack Symptoms Different For Men and Women?</h2><p> Some signs of a heart attack are common for both genders, but a few are not. Understanding all the potential signs of a heart attack is essential to get proper care quickly.</p><p> When women experience heart attack symptoms that are less well known, they are more likely to ignore them or be dismissed by doctors. Unfortunately, this can lead to poor health outcomes, so it’s essential to understand how heart attacks can feel different depending on your gender.</p><p> <a target='_blank' rel='noopener noreferrer'  href='https://mcpress.mayoclinic.org/women-health/part-1-heart-disease-in-women-unsuspected-overlooked-ignored/' >Heart disease is the number one killer for women</a>, which makes it especially unfortunate that women are often misdiagnosed</p><h2>What Are the Warning Signs of a Heart Attack for Women?</h2><p> While women can experience the traditional chest pain that men often have during a heart attack, they are more likely to have less conventional symptoms.</p><p> For example, women may have extreme fatigue, indigestion and vomiting, or pain in their lower chest or abdomen. These symptoms might not immediately be associated with a heart attack. It’s easy to mistake these symptoms for something else or ignore them altogether.</p><p>Women should watch for the following signs of a heart attack:</p><p>● Chest pain, but this isn’t always present</p><p>● Jaw, neck or upper back pain</p><p>● Pressure in the lower chest or abdomen</p><p>● Nausea or vomiting</p><p>● Indigestion</p><p>● Shortness of breath</p><p>● Fainting</p><p>● Extreme fatigue</p><p> If a woman suspects she is having a heart attack, it’s essential to call 911 immediately and get medical help right away.</p><h2>What Are the Warning Signs of a Heart Attack for Men?</h2><p> Men have signs of a heart attack that most people are more familiar with.</p><p>A man who’s having a heart attack may feel:</p><p>● Chest pain or a squeezing chest pressure</p><p>● Jaw, back, or neck pain</p><p>● Shortness of breath</p><p>● Nausea or vomiting</p><p> Unfortunately, because a lot of heart attack education focuses on men’s symptoms, a woman’s heart attack can be missed. A recent study showed that doctors <a target='_blank' rel='noopener noreferrer'  href='https://www.ahajournals.org/doi/10.1161/circulationaha.117.031650'>missed heart attack signs in women 50 percent of the time</a>.</p><h2>What Can I Do to Prevent Heart Disease?</h2><p> In the United States, heart disease is the leading cause of death <a target='_blank' rel='noopener noreferrer'  href='https://www.cdc.gov/heartdisease/facts.htm'>for both men and women</a>. How can you prevent heart disease?</p><p> There are a variety of risk factors that can increase your chances of heart disease. By keeping these under control, you can help prevent heart disease.</p><p>Risk factors include:</p><p>● Smoking</p><p>● Diabetes</p><p>● Obesity</p><p>● High blood pressure</p><p>● A family history of heart disease</p><p> While you can’t do much about your family history, healthy choices can make a difference. These include choosing to live a healthy lifestyle with regular physical activity, healthy eating and avoiding smoking and substance use can make a big difference.</p><p> There are also specific risk factors that affect women more than men, including:</p><p>● Low levels of estrogen after menopause</p><p>● High blood pressure during pregnancy</p><p> ● Rheumatoid arthritis and other autoimmune diseases, which are more common in women than men</p><p>● Stress and depression, which are more common in women</p><p>● A lack of awareness of how heart disease affects women</p><br/><p> As a woman, it’s a good idea to not only live a healthy lifestyle but also to get regular cardiovascular screenings. That will help you keep your heart health top-of-mind and make it easier to recognize if you’re experiencing heart attack symptoms.</p><h2>Can Routine Tests With My Doctor Detect Heart Problems?</h2><p> Heart disease can be detected through some blood tests, but generally, your doctor will need to do specialized testing to detect heart disease.</p><p> This might include an EKG or ECG, heart monitoring, exercise or stress tests, and other specialized tests that scan and test your heart. One reason that it’s so important to be aware of your cardiac risk factors is that your doctor can use that information to determine how often to order cardiovascular screenings.</p><h2>Take Care of Your Heart During American Heart Month</h2><p> February is American heart month, which makes it a great time to take a look at your lifestyle and health and determine if cardiovascular screening makes sense for you.</p><p> Now that you know more about how heart attack symptoms vary between men and women, you can be more aware of when you or someone you love might be experiencing a heart attack and get immediate help. Don’t let anyone dismiss your concerns — insist on the testing you need.</p><p> With a healthy lifestyle and regular medical care, you can keep your heart healthy for years to come!</p><br/><p> <i>No content on this site, regardless of date, should ever be used as a substitute for direct medical advice from your doctor or qualified clinician.</i></p>"
    },
    {
        "id": "why-do-men-&-women-need-sti-checkups",
        "image": "/img/blog/pexels-shvets-production-7191862.jpg",
        "imgAlt": "Men and Women Need STI Checkups",
        "title": "Why Do Men and Women Need to Have STI Checkups?",
        "subtitle": "To protect your health and the health of your sexual partners, it’s essential for both men and women to have regular STI checkups.",
        "CTA": "false",
        "content": "<p> In 2019 <a target='_blank' rel='noopener noreferrer'  href='http://cdc.gov/nchhstp/newsroom/docs/factsheets/STD-Trends-508.pdf'> over 2.5 million new cases of STIs</a> were reported in the United States, according to the CDC. Some of these diseases are easily treated with antibiotics. But these illnesses can cause serious long-term health risks if left untreated.</p><p> Unfortunately, many sexually transmitted infections (STIs) don’t cause symptoms. If you don’t get STI testing regularly, you may not know you have an infection until serious health concerns arise. By then, a lot of the damage has been done.</p><p> To protect your health and the health of your sexual partners, it’s essential for both men and women to have regular STI checkups.</p><h2>Common Causes of STIs</h2><p> Sexually transmitted infections are caused by bacteria, parasites, or viruses that are spread through sexual activity, including vaginal, oral and anal sex. Less commonly, they can spread through intimacy such as heavy petting. Condoms can effectively stop the spread of some STIs, but no method is perfect, so STI testing is so important.</p><p> Outside of sexual activity, sharing contaminated needles can also spread STIs. This isn’t limited to drugs — tattoo needles and body piercing equipment can transmit some of these illnesses.</p><h2>STI Symptoms for Women</h2><p> What will a woman experience if she has an STI? Of course, it depends on the disease, and some of them won’t have symptoms. However, that doesn’t mean they’re not damaging your body — and you can still pass them to another person.</p><p> If you have <a target='_blank' rel='noopener noreferrer'  href='https://www.healthline.com/health/sexually-transmitted-diseases/women' > any of the following symptoms</a> as a woman, you’ll want to see a doctor or visit urgent care to get STI testing:</p><br/><p>● Vaginal itching</p><p>● Pain when urinating</p><p>● Rashes</p><p>● Unusual vaginal discharge</p><p>● Pain around the pelvis</p><p>● Pain during sex</p><p>● Sores, blisters, or bumps in your mouth, anus, or vagina</p><p>● Frequent needs to go to the bathroom</p><p> However, just because you don’t have symptoms doesn’t mean you needn’t be tested for STIs. It’s a good idea to get tested regularly to get treatment for illnesses that don’t show symptoms but can still cause long-term damage.</p><h2>STI Symptoms for Men</h2><p> Women aren’t the only ones that need regular STI testing. Men can also have serious health issues from these diseases, which sometimes have symptoms and sometimes don’t.</p><p>Men should look for the following STI symptoms:</p><p>● Burning or itching in the penis</p><p>● Pain around the pelvis</p><p>● A drip from the penis</p><p>● Blisters, sores, or bumps on the anus, penis, or mouth</p><p>● Burning pain with bowel movements or urination</p><p>● Having to go to the bathroom frequently</p><p> If you experience these as a man, it’s vital to go to the doctor or quick care clinic so that you can get tested. However, even if you don’t have symptoms, you should be regularly tested for STIs to protect yourself and your sexual partners.</p><h2>Preventing STIs</h2><p> There are <a target='_blank' rel='noopener noreferrer'  href='https://www.cdc.gov/std/prevention/lowdown/'> ways to prevent STIs</a> , and the most obvious is abstaining from vaginal, anal, or oral sex and avoiding contaminated needles from drug use, tattoos, or body piercing.</p><p>However, if you are sexually active, you can also:</p><p>● Use condoms every time you have sex, which lowers your risk</p><p>● Have fewer sexual partners</p><p>● Consider an HPV vaccine</p><p> It’s also essential to have regular testing to get treatment and notify your partners if you test positive for an STI.</p><h2>Should You Have an STI Test? What Are the Benefits?</h2><p> Regular STI testing helps you protect your health and the health of your sexual partners. This is especially important because many STI infections don’t symptoms but can still damage your long-term health.</p><p> Testing gives you peace of mind, allows you to recover from curable STIs, and get treatment to lessen symptoms.</p><p> Untreated STIs can cause infertility and certain types of cancer in both men and women. It pays to know and get the treatment you need.</p><h2>STI Treatment</h2><p> There are <a target='_blank' rel='noopener noreferrer'  href='https://www.mayoclinic.org/diseases-conditions/sexually-transmitted-diseases-stds/diagnosis-treatment/drc-20351246' > several treatments available</a> for STIs. If you are diagnosed with a bacterial STI like syphilis, chlamydia, or gonorrhea, you can get antibiotics. You may only need a single course of treatment.</p><p> Antiviral drugs can treat viral STIs like HIV or herpes. For herpes, the treatment suppresses the symptoms, but you can still pass herpes to a sexual partner. HIV antiviral drugs can keep the illness in check for many years, but you risk transmitting the infection to another partner.</p><p> Of course, if you are diagnosed with an STI, it’s important to notify any sexual partners immediately so they can also get tested and treated.</p><h2>When to See a Doctor or Visit Urgent Care</h2><p> If you have any symptoms of an STI, it’s important to see your doctor or visit urgent care right away. The sooner you get treatment, the sooner you’ll be able to reduce or eliminate your symptoms and improve your long-term health.</p><p> Even if you don’t have symptoms, if you’re sexually active, you should be tested for STIs regularly. That way, you can catch asymptomatic illnesses and get the treatment you need.</p><p> Our Qcare mobile clinics can help you get the necessary STI testing quickly and easily. Contact us to set up an appointment today.</p><div> <br/></div>"
    },
    {
        "id": "how-much-sleep-adults-need",
        "image": "/img/blog/pexels-pixabay-371109.jpg",
        "imgAlt": "How Much Sleep Adults Need",
        "title": "Do You Sleep Enough? How Much Adults Need",
        "subtitle": "With technology, busy schedules and work that blends into home life, it’s no surprise that the average American gets only six or less hours of sleep a night.",
        "CTA": "true",
        "content": "<p> With technology, busy schedules and work that blends into home life, it’s no surprise that the average American gets only <a target='_blank' rel='noopener noreferrer'  href='https://www.cdc.gov/mmwr/volumes/69/wr/mm6916a5.htm?s_cid=mm6916a5_w' >six or less hours</a> of sleep a night. The CDC recommends that adults get seven or more hours of sleep each night</p><p> Sometimes this lack of sleep is due to lifestyle choices and lack of time, in which case you can create better sleep habits by setting boundaries and reducing stimulation before bedtime.</p><p> However, many people have medical reasons for not being able to sleep. If this could be you, it’s important to see a doctor or visit urgent care to get a diagnosis and treatment.</p><h2>How to recognize sleep issues</h2><p> While insomnia is the most well-known issue, there are many other causes for loss of sleep.</p><p>Common sleep disorders include:</p><p>● Insomnia</p><p>● Sleep apnea</p><p>● Restless leg syndrome</p><p>● Hypersomnia (unable to stay awake during the day)</p><p>● Problems with sleep cycles</p><p>● Parasomnia (sleep walking, talking, etc)</p><p> You can recognize if you struggle with sleep by noting how long it takes you to fall asleep, how often you wake up in the night and how sleepy you are during the day. If you have a partner, they may also notice things like jerking movements or breathing interruptions during sleep.</p><p> If you think you have a sleep problem, it’s important to schedule an appointment with a doctor to diagnose the issue so you can get the treatment you need.</p><h2>What causes insomnia?</h2><p> Insomnia is one of the more common sleep problems. What causes it, and how can you treat it?</p><p> There are two kinds of insomnia, acute (short-term) and chronic. Acute insomnia can happen due to stressful or traumatic events and generally gets better in a few days or weeks.</p><p> Chronic insomnia, which lasts 30 days or more, can be caused by medical conditions, ongoing stress or trauma or poor sleep habits. Often, treating the underlying cause of insomnia resolves the issue and allows you to get better sleep.</p><p> It’s important to get the treatment you need and make changes to your life to alleviate factors that are causing insomnia. Not only do you deserve good rest, but your body needs it in order to function properly.</p><h2>What happens to your body on too little sleep</h2><p> Your sleep patterns significantly affect your mental and physical health, which is why it’s so important to get enough sleep and get treatment if you need help sleeping.</p><p> If you don’t get enough sleep, <a target='_blank' rel='noopener noreferrer'  href='https://www.nhlbi.nih.gov/health/sleep-deprivation'>you can experience</a>:</p><p>● A lack of focus that affects your work or school performance</p><p>● Slow reaction times, which can cause accidents and injuries</p><p>● Mental health issues such as depression or anxiety</p><p> ● Serious health problems like heart disease, kidney disease, high blood pressure, stroke and diabetes</p><p> If you struggle with insomnia or other sleep problems, you can get help. Don’t put it off — make an appointment with your doctor or visit a Qcare mobile station near you today.</p><h2>Tips for better sleep</h2><p> If your doctor determines that there’s not a medical issue causing your sleep problems, it could be a matter of your habits and lifestyle. Fortunately, there are <a target='_blank' rel='noopener noreferrer'  href='https://www.cdc.gov/sleep/about_sleep/sleep_hygiene.html'>small changes you can make</a> that can improve your sleep quality.</p><p> Start with choosing consistent times for going to bed and waking up. Be sure your sleeping area is dark without distractions or noise and keep it at a comfortable temperature.</p><p> It’s also important to limit electronic devices before bed. The blue light interrupts your sleep rhythms. Keep electronic devices out of the bedroom as well.</p><p> Getting exercise during the day can also help you fall asleep more easily. Finally, avoid caffeine, large meals, or high amounts of stress within an hour or two of bedtime.</p><p> Taking these steps can make sleep easier and improve your physical and mental health at the same time.</p><br/><h3>When to See a Doctor or Visit Qcare</h3><p> When are your sleep problems bad enough to warrant medical care?</p><p> Because sleep is so important, it’s a good idea to talk to a clinician about any sleep interruption that lasts more than a few days. You can start by keeping a sleep journal and recording times you go to bed, fall asleep, wake up, take naps, exercise, and drink alcohol or caffeinated beverages.</p><p> After a few days, you can take the journal to your doctor or urgent care. They can look for patterns and do additional tests to determine what’s causing your sleep problems. From there, they will be able to connect you with the care you need to start sleeping better.</p><h2>Start getting the sleep you need today</h2><p> Getting enough sleep is essential for your health, safety, and well-being. If you’re one of the millions of Americans that don’t get enough sleep, take steps to improve your situation today.</p><> You can start with a visit to your doctor or Qcare. We’re here to help you understand your health and get the care you need. Stop by a mobile station or click below to make an appointment today!</p>"
    },
    {
        "id": "tiktok-health-trends-true-or-false",
        "image": "/img/blog/pexels-cottonbro-studio-5081930.jpg",
        "imgAlt": "TikTok Health Trends",
        "title": "TikTok Health Trends: True or False?",
        "subtitle": "With the time that young adults and teens spend on Tik Tok, it’s no surprise that trends often start there. When it comes to health trends, it’s important to consider whether a source is reputable or not. After all, anyone can become a content creator.",
        "CTA": "true",
        "content": "<p> With the time that young adults and teens spend on Tik Tok, it’s no surprise that trends often start there. When it comes to health trends, it’s important to consider whether a source is reputable or not. After all, anyone can become a content creator</p><p> Recently, several health trends have gained traction on TikTok, where <a target='_blank' rel='noopener noreferrer'  href='https://www.oberlo.com/statistics/tiktok-age-demographics'>71.3 percent of users are aged 18-34</a>. We’ll look at what experts say so you know what to avoid (and what might help.)</p><p> However, remember that the best resource is always a doctor — and getting an appointment at Qcare to get all your healthcare concerns answered is quick and easy!</p><h2>Liquid chlorophyll for energy and weight loss</h2><p> One recent trend shows TikTokers squirting green liquid chlorophyll into water and drinking it. Many claim to have increased energy and that it helps with weight loss.</p><p>Is it true?</p><p> While chlorophyll is an antioxidant, it doesn’t dissolve in water. That means what you’re ingesting is more likely to be chlorophyllin, and experts say there’s not enough evidence that either chlorophyll or chlorophyllin improves your health to bank on it.</p><p> If you want to get more chlorophyll, one of the best ways — and one known to be healthy — is to eat more leafy green vegetables. That’s a better route than liquid chlorophyll, according to doctors.</p><h2>Mouth taping for snoring</h2><p> Do you snore, have a dry mouth when you wake up or struggle with bad breath? If so, some TikTok influencers suggest using “mouth taping,” where you tape your mouth shut during the night.</p><p>Is it true?</p><p> This is one <a target='_blank' rel='noopener noreferrer'  href='https://www.tiktok.com/@doctor.rizwan/video/7143269555706596613'>where doctors disagree</a>. While nose-breathing can be helpful, taping your mouth shut is not how to manage a sleep issue. This approach can irritate your skin, obstruct your breathing and make it hard to get restorative sleep.</p><p> It can also be dangerous if you have a condition like sleep apnea, which can cause serious health problems if left untreated. If you struggle with sleep, it’s important to talk to your doctor and schedule a sleep study to diagnose the real problem and get the needed treatment.</p><h2>Proffee: protein and coffee mixed</h2><p> TikTokers regularly share interesting food and drinks on the app. One recent trend is mixing a protein shake with cold brew coffee to create “proffee.” Some even claim it helps them lose weight and have a healthier diet.</p><p>Is it true?</p><p> This is another trend that is unlikely to have significant health benefits. However, it also isn’t particularly harmful. It’s not likely to create weight loss on its own, and it shouldn’t replace a healthy meal that includes protein, carbs and fat.</p><p> Experts say that if you enjoy coffee mixed with a protein drink, having one isn’t likely to cause problems either. Of course, this is only true in moderation and if you don’t have any other negative health interactions with caffeine or the ingredients of a protein drink.</p><p> If you like this as a way to get your day started, that’s great, just don’t expect it to fix any health issues!</p><h2>Garlic up your nose for sinus congestion?</h2><p> Garlic is often touted as a home remedy for various ailments. Recently people have been on TikTok putting raw garlic cloves up their noses, claiming that it relieves sinus congestion.</p><p>Is it true?</p><p> According to doctors, <a target='_blank' rel='noopener noreferrer'  href='https://www.prevention.com/health/a36981817/garlic-in-nose-for-sinus-congestion/' >it doesn’t</a>. All you do is block your sinuses for several minutes, causing mucus to flow more quickly when you remove the garlic. Also, the smell of garlic is an irritant, which produces more mucus, not less.</p><p> Finally, if a small piece is left behind when you remove the garlic, it could cause a rash or infection, which can cause problems.</p><p> Skip the garlic and get proper care for your sinus congestion. Don’t be afraid to make an appointment at Qcare if things don’t clear up or you’re worried about a sinus infection.</p><h2>Dry scooping pre-workout powder</h2><p> If you’re about to go into a strenuous workout, you might consider having a pre-workout drink made by mixing protein powder with water. Some TikTok influencers are suggesting that you skip the water entirely and just eat the powder dry.</p><p> The claim is that this allows you to absorb the nutrients in the powder faster, leading to a better workout.</p><br/><p>Is it true?</p><p> Unfortunately, this Tik Tok health trend is not only false, but it’s also very dangerous.</p><p> Dietary supplements like pre-workout powder are not heavily regulated and labels are not always accurate about what’s inside. As a result, you can ingest too much caffeine or another stimulant. This can cause heart problems and even heart attacks.</p><p> Another problem is the fine nature of the powder, which is meant to be dissolved in water. Breathing it in can damage your esophagus and lungs and may even trigger an asthma attack.</p><p> Definitely skip this one. It’s not only unhelpful, but it’s actually dangerous to your health.</p><h2>Get the care you need from urgent care</h2><p> If you have a health concern and questions about treatment, TikTok is not the best resource.</p><br/><p> Instead, stop by Qcare for an appointment. You’ll talk to a qualified doctor who can give you proper medical advice.</p><p>Your health is important — protect it!</p><div> <br/></div>"
    },
    {
        "id": "allergies-vs-sinusitis",
        "image": "/img/blog/pexels-edward-jenner-4031631.jpg",
        "imgAlt": "Allergies vs. sinusitis",
        "title": "Allergies vs. sinusitis: What’s the Difference?",
        "subtitle": "With spring’s arrival in New York City and flowers and trees blooming – allergy season is in full effect. For some, though, sinus pressure might indicate something more serious, like a sinus infection. How can you tell the difference?",
        "CTA": "true",
        "content": "<p> With spring’s arrival in New York City and flowers and trees blooming – allergy season is in full effect. For some, though, sinus pressure might indicate something more serious, like a sinus infection. How can you tell the difference?</p><p> Allergies and sinusitis feel similar and are easy to confuse. However, the treatment is different. Knowing which one you have helps get rid of those pesky symptoms quickly and return to feeling like yourself.</p><p> Use this guide to help you understand if you’re suffering from allergies or sinusitis and what next steps you should take.</p><h2>Understanding allergies</h2><p> <a target='_blank' rel='noopener noreferrer'  href='https://aafa.org/allergies/'>Allergies</a> are caused by your body’s response to something specific in the environment around you, such as pollen, pet dander, mold, certain foods and more.</p><p> An allergy causes your sinuses to swell, and you may experience a runny or stuffy nose, watery or itchy eyes, sneezing and wheezing. Generally, these symptoms reduce when you’re away from the allergen and worsen when you’re near it.</p><p> There are many things in the environment that people can be allergic to, indoors and outdoors. You may also have multiple allergies, which makes pinpointing the source more challenging. Seeing a doctor can help you identify your specific allergies.</p><h2>What is sinusitis?</h2><p> Sinusitis is an inflammation of the sinuses that is often caused by bacteria, which means that antibiotics are an important treatment to help you get better quickly.</p><p> You may experience swelling and pain around your forehead and face, colored mucus when you cough, bad breath, a sore throat and even a fever. It’s important to see a doctor or visit an urgent care clinic to see if you have a sinus infection.</p><p> Acute sinusitis lasts a few weeks, but chronic sinusitis can last several months. If you have allergies or asthma, you’re at a higher risk of having chronic sinusitis.</p><h2>Similarities and differences between allergies and sinusitis</h2><p> Both allergies and sinus infections involve inflammation of the sinuses, runny nose, and coughing and sneezing. At the beginning of the illness, it can be easy to dismiss a sinus infection as being “just allergies.”</p><p> However, sinusitis has <a target='_blank' rel='noopener noreferrer'  href='https://www.pennmedicine.org/for-patients-and-visitors/patient-information/conditions-treated-a-to-z/sinus-infections-sinusitis#:~:text=Symptoms,-The%20symptoms%20of%20acute%20sinusitis' >a few distinctive symptoms</a> to watch for. Colored mucous, bad breath, and a swollen, painful feeling around the forehead and face are unique to sinus infections. Also, if you have a stuffy nose and cough that lasts for longer than a week or two or doesn’t change when your environment changes, that’s a sign to see a doctor about a sinus infection.</p><p> If you’re unsure, consider making an appointment with urgent care to get tested for sinusitis. If you have a bacterial infection, you’ll want to treat it right away to get better quickly and return to daily life.</p><h2>How are allergies and sinusitis diagnosed?</h2><p> What can you expect if you go to the doctor concerned about your sinuses?</p><p> If the clinician thinks you might have allergies, they’ll ask about your lifestyle, family history of allergies, and more. The doctor will then look at your ears, nose, throat, eyes and chest to see how the illness affects you, which might cause them to determine you have sinusitis rather than allergies.</p><p> Finally, several allergy tests will help you determine what you’re allergic to and how best to treat it. The doctor could do a skin prick test, blood test, patch test, or take another approach.</p><p> When diagnosing a sinus infection, the doctor will look at your ears, nose and throat to see if there are blockages and to look for signs of an infection. This usually provides enough information for the doctor to determine if you have sinusitis, but if your case is severe or complex, you may be referred to an ear, nose, and throat (ENT) specialist.</p><h2>Treatments for allergies and sinusitis</h2><p> To <a target='_blank' rel='noopener noreferrer'  href='https://www.mayoclinic.org/diseases-conditions/hay-fever/in-depth/seasonal-allergies/art-20048343' >treat allergies</a>, the doctor will suggest limiting your exposure to the allergen if possible and using a nasal steroid spray and antihistamine pills. You can explore getting allergy shots or under-the-tongue medications if your allergies don’t respond to these treatments.</p><p> Sinusitis treatment generally requires antibiotics. Oral or topical steroids can also reduce inflammation if needed. Nasal decongestants, antihistamines and nasal sprays can also help relieve symptoms as you recover.</p><p> If you have anatomical defects in your sinuses causing chronic sinusitis, surgery can be an option to give you a long-term solution.</p><h2>Qcare urgent care services</h2><p> Starting to feel ill right when the weather is getting nicer is not fun, but the good news is that allergies and sinusitis can be treated effectively.</p><p> If you’re experiencing sinus infection symptoms, such as pain around your forehead, eyes, and cheeks or bad breath and colored mucous, you’ll want to make an appointment with urgent care right away. Treatment will shorten your illness and help you get back to daily life quickly.</p><p> If you have allergies, our urgent care services can help you determine which treatment is best for you, from nasal sprays to antihistamines to prescription options.</p><br/><p> Simply make an appointment or stop in — we’re here to help you enjoy spring and summer!</p>"
    },
    {
        "id": "soothe-your-aching-joints",
        "image": "/img/blog/elderly-woman-suffering-from-pai.jpg",
        "imgAlt": "Help Soothe Your Aching Joints",
        "title": "Help Soothe Your Aching Joints: Learn All About Arthritis and How To Treat It",
        "subtitle": "For May’s Arthritis Awareness Month here’s what you need to know about arthritis – what it is, the different types of pain it causes, and most importantly, what you can do to help manage debilitating symptoms.",
        "CTA": "true",
        "content": "<p> While it’s true that arthritis is more common among seniors, there are over <a target='_blank' rel='noopener noreferrer'  href='https://www.arthritis.org/health-wellness/healthy-living/managing-pain/understanding-pain/sources-of-arthritis-pain' >100 forms</a> of arthritis, affecting people of all ages and diverse backgrounds.</p><p> For May’s Arthritis Awareness Month here’s what you need to know about arthritis – what it is, the different types of pain it causes, and most importantly, what you can do to help manage debilitating symptoms.</p><h2>How Does Arthritis Feel?</h2><br/><p> Arthritis feels different for everyone. <a target='_blank' rel='noopener noreferrer'  href='https://orthop.washington.edu/patient-care/articles/arthritis/frequently-asked-questions-about-arthritis.html' >1 in 7 Americans have arthritis</a>, yet there are still misconceptions. Some people have typical joint stiffness and difficulty moving around. But since there are so many different types of arthritis, everyone’s experience is unique.</p><br/><p>Arthritis pain can feel:</p><ul> <li> <p>Tender</p></li><li> <p>Achy</p></li><li> <p>Dull</p></li><li> <p>Sharp</p></li><li> <p>Tingly</p></li><li> <p>Numb</p></li><li> <p>Burning</p></li><li> <p>Throbbing</p></li></ul><p> You might start with joint pain but progress to sharp, shooting pains as if you’re getting an electrical shock. This is a sign that you’re experiencing nerve pain. Let your doctor know or schedule a visit at Qcare.</p><h2>Different Types of Arthritis Equals Different Types of Pain</h2><p> The pain you feel depends on the type of arthritis you have. Let’s talk about some common forms of arthritis and how they feel.</p><br/><ul> <li> <p> Osteoarthritis (OA) is a degenerative disease of the whole joint, protective cartilage of the joint, and the fluid around it. This means that these areas slowly break down. Like most types of arthritis, OA produces inflammation in the body and commonly affects knees, hips, hands, and the spine. OA pain can feel achy and tender, or your joints are grating and scraping on each other. </p></li></ul><br/><ul> <li> <p> Rheumatoid Arthritis (RA) is an autoimmune disorder where inflammation becomes overactive and the body attacks healthy tissue (often the lining of the joints). With RA you can experience a hot pain or a deep ache in your bones and feel very weak and tired. </p></li></ul><br/><ul> <li> <p> Juvenile Idiopathic Arthritis (JIA) is diagnosed in childhood and is an autoimmune disorder similar to RA. It’s extremely painful, causing sharp pains and a feeling like your joints are on fire or you can’t move. </p></li></ul><ul> <li> <p> Gout is when the joints get inflamed because of high uric acid levels, a waste product in our blood. When the body can’t break down uric acid fast enough, it forms crystals in the joints – causing severe pain. Gout affects a specific joint, like the big toe. Flare-ups come on very suddenly, leaving the joints feeling hot, tender, and unable to be touched without severe pain. </p></li></ul><br/><p> Even though arthritis can be debilitating, there are comprehensive treatment options from medications to lifestyle changes that can help you find some pain relief.</p><h2>What Are Common Arthritis Treatments?</h2><p> Treatment for arthritis depends on the type of arthritis you have. For autoimmune disorders like rheumatoid arthritis and juvenile idiopathic arthritis, you might need medications called disease-modifying antirheumatic drugs (DMARDs) to help reduce inflammation in your body. Biologics are another powerful drug to help stop inflammation and reduce damage to other organs.</p><p> Because every type of arthritis has a different treatment, talk to your doctor or visit a Qcare mobile clinic to discuss what’s best for you.</p><p>Some common arthritis treatments include:</p><ul> <li> <p>Hot and cold therapy</p></li><li> <p>Topical rubs</p></li><li> <p>Physical therapy (PT) or regular physical activity</p></li><li> <p>Corticosteroids</p></li><li> <p> Diet changes like drinking more water or avoiding certain foods </p></li><li> <p>Weight loss</p></li></ul><p> Your treatment plan might also include visiting a specialist. If your arthritis is causing problems with your skin, eyes or other organs, your doctor may want to refer you to a specialist who can help.</p><h2>Joint Pain Management Can Help</h2><p> Arthritis treatment should be flexible and tailored to your specific needs. In addition to the common treatments discussed above, you can minimize pain and help protect your body with joint protection, a way to modify your body movements to <a target='_blank' rel='noopener noreferrer'  href='https://orthop.washington.edu/patient-care/articles/arthritis/frequently-asked-questions-about-arthritis.html' >avoid severe stress on the joints</a>. For example, you can use larger joints like your forearm to carry your grocery bags rather than your fingers.</p><p>Other ways you can manage your joint pain include:</p><ul> <li> <p>Using assistive devices when needed</p></li><li> <p>Alternate between rest and activity</p></li><li> <p> Over-the-counter medications such as acetaminophen ibuprofen and naproxen sodium </p></li><li> <p> Cognitive behavioral therapy (CBT): a type of therapy that has been proven to be effective for people managing chronic conditions because they learn to manage physical, behavioral and emotional triggers of pain. </p></li></ul><h2>See a Doctor For Joint Pain Today</h2><p> Are you wondering if your joint pain is arthritis? Before you can be treated, you’ll need a thorough exam from a doctor to know exactly what you’re dealing with. Don’t suffer for another day. Make an appointment with Qcare today to get relief for your joint pain.</p><div> <br/></div>"
    },
    {
        "id": "how-to-prevent-tick-bites-this-season",
        "image": "/img/blog/pexels-erik-karits-11019896.jpg",
        "imgAlt": "How To Prevent Tick Bites This Season",
        "title": "Ticks Suck: Here's How To Prevent Tick Bites This Season",
        "subtitle": "With the warm weather comes the concern for tick bites and tick-related illnesses.",
        "CTA": "true",
        "content": "<p> With the warm weather comes the concern for tick bites and tick-related illnesses. While you’re most likely to get a tick bite after a camping trip upstate, ticks have been found in parts of New York City such as the <a target='_blank' rel='noopener noreferrer' href='https://www.nyc.gov/site/doh/health/health-topics/ticks.page#:~:text=Ticks%20have%20been%20found%20throughout,and%20other%20tick%2Dborne%20diseases.' >Bronx and Staten Island.</a></p><br/><p> Ticks are starting to <a target='_blank' rel='noopener noreferrer' href='https://www.npr.org/sections/health-shots/2021/07/04/1012643351/tick-bite-disease-safety-tips' >branch out into different locations</a>, so they might show up when you least expect it. Since they carry viruses, bacteria and parasites it’s important to know how to prevent tick bites and what to do if you get one.</p><br/><h2>How To Prevent Tick Bites Before You Leave The House</h2><br/><p> Preventing a tick bite starts with preparing for your outing. Here are three easy ways you can prevent tick bites before you leave the house.</p><br/><p> Know where ticks live: Understanding where ticks live is important for prevention. Woods, grassy areas and mountains are known for high tick activity. Hiking, hunting and walking on trails can increase your chances of getting a tick bite. Some resources to help assess your risk of encountering a tick are: local health departments, local news and weather forecasts and websites that map out where tick activity is the highest.</p><p> Dress for the occasion: If possible, wear long sleeve shirts and pants. Tucking your pants into socks or taping where your pants meet your socks can help prevent ticks from getting to your feet. Choosing light-colored clothing helps you easily spot a tick that attaches to you.</p><p> Spray gear with repellant: If you’re going to be in a high-tick area, you can spray your clothes and gear with Environmental Protection Agency (EPA) registered insect repellents. They can be a powerful tool to keep ticks away. The best repellents will have ingredients such as <a target='_blank' rel='noopener noreferrer' href='https://magazine.medlineplus.gov/article/understanding-and-preventing-tick-bites' >DEET, permethrin or picaridin</a>.</p><h2>After Your Come Inside: Check For Ticks</h2><br/><p> After you’ve been outdoors, it’s important to <a target='_blank' rel='noopener noreferrer' href='https://www.cdc.gov/ticks/avoid/on_people.html' >inspect your body and your gear for ticks.</a> The quicker you spot a tick or tick bite, the easier it is to deal with.</p><br/><p> Check your clothes for ticks: You’ll want to quickly check your clothes for ticks to see if you have any on the outside. Then, wash and dry your clothes to remove ticks that might be clinging to them. Drying clothes on high heat for at least 6 minutes can help kill any you have.</p><p> Examine pets: Thoroughly examine your pets because ticks love to attach themselves to animals. Ticks can be hard to spot on pets, so a thorough check of their fur, skin and in between their paws is essential.</p><p> Give yourself a head-to-toe inspection: Giving yourself a head-to-toe inspection can help you spot a tick bite early. Taking a shower within two hours of coming inside can reduce your chances of contracting a serious illness from a tick bite.</p><h2>How To Check For Tick Bites</h2><p> After you take off your clothes, examine your whole body. Going from your head down to your toes is helpful so you don’t miss any parts of your body. If needed, use mirrors to see areas that are hard for you to see.</p><p>You’ll want to check:</p><ul> <li> <p>Your head and hair</p></li><li> <p>In and around your ears</p></li><li> <p>Under your arms</p></li><li> <p>In between your fingers</p></li><li> <p>Around your waist (including your belly button)</p></li><li> <p>Between your legs</p></li><li> <p>Back of knees</p></li><li> <p>Feet, ankles and in between toes</p></li></ul><p> Ticks can easily hide in the warm crevices of the body and they’re very tiny (about the size of a poppy seed) when they bite. So look for something that’s small, brown or black in color.</p><h2>How To Handle A Tick Bite</h2><p> First, you’ll want to stay calm to successfully remove the tick – the quicker you remove the tick, the less likely it is that you’ll get sick.</p><br/><p> Remove the tick: You’ll want to get tweezers and get as close to the skin as possible. Then, pull the tick out in ∫. This is important to get the whole thing out because partial removal can cause the tick to stay in and transmit illnesses to you. If you’re outdoors a lot, consider getting tick removal kits to have with you.</p><p> Save the tick: Saving the tick in a plastic bag can help identify what type of tick it is and if it’s carrying any disease-containing pathogens.</p><p> See a doctor: Getting a tick bite can be scary, see your healthcare provider or visit a Qcare mobile clinic for a thorough examination.</p><h2>When To See A Doctor for a Tick Bite</h2><p> It’s important to monitor yourself for symptoms after a tick bite. You should see a healthcare provider right away if:</p><ul> <li> <p>You’re unsure if you got the whole tick out</p></li><li> <p>You can’t get the tick out</p></li><li> <p>You develop a rash in the shape of a “bulls-eye”</p></li><li> <p> You develop flu-like symptoms such as fever, chills, muscle aches, headache and fatigue </p></li><li> <p>You experience muscle weakness or difficulty breathing</p></li></ul><p> Remember, early treatment helps prevent serious long-term illness. If you have any questions or concerns after a tick bite, visit a Qcare clinic today. Simply walk in or make an appointment. We’re here to answer all your tick-related questions.</p>"
    }
]